
Network Working Group                               Li Zhiming (editor)
Internet Draft                                                   Huawei
							                 Nora Dabbous
										    Gemplus
							                 JunHyuk Song
					                      Samsung Electronics
					                       	        Jian Wang
					            	      	        DMT
								
Expires: 15 October, 2004                                15 April, 2004 
                                                                       


                         EAP CAVE Authentication 
                 draft-lizhiming-pppext-eap-cave-00.txt 


Status of this Memo 

   This document is an Internet-Draft and is subject to all provisions 
   of Section 10 of RFC2026. 

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups. Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six 
   months and may be updated, replaced, or obsoleted by other documents 
   at any time. It is inappropriate to use Internet- Drafts as 
   reference material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at: 
        http://www.ietf.org/ietf/1id-abstracts.txt 

   The list of Internet-Draft Shadow Directories can be accessed at: 
        http://www.ietf.org/shadow.html. 

   Comments should be submitted to the eap@frascone.com mailing list. 

   Distribution of this memo is unlimited. 

Abstract 

   This document specifies an Extensible Authentication Protocol (EAP) 
   mechanism for authentication and session key distribution using the 
   cdma Universal Identity Module (UIM). The mechanism includes 
   network authentication, user anonymity support and a 
   re-authentication procedure. 







Lizhiming                                         [Page 1] 

Internet Draft          EAP CAVE Authentication        15 April, 2004 


Table of Contents 

    
   Status of this Memo.........................................1 
   Abstract....................................................1 
   Table of Contents...........................................2 
   1. Introduction.............................................3 
   2. Terms....................................................4 
   3. Overview.................................................6 
   4. Operation................................................8 
   4.1. Version Negotiation....................................8 
   4.2. Identity Management....................................9 
   4.3. Re-Authentication.....................................26
   4.4. EAP/CAVE SSD Update...................................30
   4.5. EAP/CAVE Notifications................................32 
   4.6. Error Cases...........................................33 
   4.7. Key Generation........................................35 
   5. Message Format and Protocol Extensibility...............38 
   5.1. Message Format........................................38 
   5.2. Protocol Extensibility................................39 
   6. Messages................................................39 
   6.1. EAP-Request/UIM/Start.................................40 
   6.2. EAP-Response/UIM/Start................................40 
   6.3. EAP-Request/UIM/Challenge.............................41 
   6.4. EAP-Response/UIM/Challenge............................41 
   6.5. EAP-Request/UIM/Re-authentication.....................42 
   6.6. EAP-Response/UIM/Re-authentication....................42 
   6.7. EAP-Request/UIM/Update................................42 
   6.8. EAP-Response/UIM/Update-server-challenge..............42 
   6.9. EAP-Request/UIM/Update-server-challenge...............43 
   6.10. EAP-Response/UIM/Update-client-success...............43 
   6.11. EAP-Request/UIM/Update-challenge.....................43 
   6.12. EAP-Response/UIM/Update-challenge....................43 
   6.13. EAP-Response/UIM/Client-Error........................44 
   6.14. EAP-Request/UIM/Notification.........................44 
   6.15. EAP-Response/UIM/Notification........................44 
   7. Attributes..............................................44 
   7.1. Table of Attributes...................................45 
   7.2. AT_MAC................................................46 
   7.3. AT_IV, AT_ENCR_DATA and AT_PADDING....................47 
   7.4. AT_VERSION_LIST.......................................49 
   7.5. AT_SELECTED_VERSION...................................50 
   7.6. AT_NONCE_MT...........................................50 
   7.7. AT_PERMANENT_ID_REQ...................................51 
   7.8. AT_ANY_ID_REQ.........................................51 
   7.9. AT_FULLAUTH_ID_REQ....................................51 
   7.10. AT_IDENTITY..........................................52 
   7.11. AT_RAND..............................................52 
   7.12. AT_NEXT_REAUTH_ID....................................53 
   7.13. AT_RANDU.............................................53 
   7.14. AT_RANDBS............................................54 


Lizhiming                                         [Page 2] 

Internet Draft          EAP CAVE Authentication        15 April, 2004 

   7.15. AT_RANDSSD...........................................54 
   7.16. AT_NOTIFICATION......................................54 
   7.17. AT_CLIENT_ERROR_CODE.................................55 
   7.18. AT_SSD_UPDATE_SUCCESS................................55 
   7.19. AT_ESN...............................................56
   7.20. AT_AUTHR.............................................56
   8. IANA Considerations.....................................56 
   9. Security Considerations.................................58 
   9.1. Identity Protection...................................58 
   9.2. Mutual Authentication.................................58 
   9.3. Key Derivation........................................59 
   9.4. Dictionary Attacks....................................59
   9.5. Credentials Reuse.....................................59 
   9.6. Integrity and Replay Protection, and Confidentiality..60 
   9.7. Negotiation Attacks...................................60 
   9.8. Fast Reconnect........................................61 
   9.9. Acknowledged Result Indications.......................61 
   9.10. Man-in-the-middle Attacks............................61 
   9.11. Generating Random Numbers............................62 
   10. Security Claims........................................62 
   11. Acknowledgements and Contributions.....................63 
   11.1. Contributors.........................................63 
   11.2. Acknowledgements.....................................63 
   Normative References.......................................63 
   Informative References.....................................64 
   Editors' and Contributors' Contact Information.............64 
   Annex A. Pseudo-Random Number Generator....................65
    
1. Introduction 

   This document specifies an Extensible Authentication Protocol (EAP) 
   [EAP] mechanism for authentication and session key distribution 
   using the cdma Universal Identity Module (UIM). 

   CDMA uses the standardized CAVE (Cellular Authentication and Voice
   Encryption) algorithm to generate a 128-bits sub-key called the 
   "Shared Secret Data" (SSD). The A-Key, the ESN(Electronic Serial 
   Number) and the network-supplied RANDSSD are the inputs to the CAVE 
   that generates SSD. The SSD has two parts: SSD_A (64 bits), for 
   creating authentication signatures and SSD_B (64 bits), for 
   generating keys to encrypt voice and signaling messages.In cdma, 
   authentication is based on a challenge-response mechanism. The UIM 
   runs CAVE algorithm, which takes the RANDU(24bits) or RAND(32bits),
   the ESN(32bits) ,MIN(34bits) and SSD-A as  input, and produces a 
   response AUTHU(24bits) or AUTHR(24bits).The UIM uses the SSD_B and 
   the CAVE algorithm to generate a Cellular Message Encryption 
   Algorithm (CMEA) key (64 bits). The CMEA key is used to encrypt of 
   signaling messages sent over the air and to decrypt the information
   received. In this protocol, CMEA key is used for deriving keying
   material and not directly used. Please find more information about 
   cdma authentication in [3GPP2 S.S0053]. 

   
Lizhiming                                         [Page 3]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   The lack of mutual authentication is a weakness in cdma 
   authentication. In EAP/CAVE the client issues a random number 
   NONCE_MT to the network, in order to contribute to key derivation, 
   and to prevent replays of EAP/CAVE requests from previous exchanges.
   The NONCE_MT can be conceived as the client's challenge to the 
   network. EAP/CAVE also extends the RAND or RANDU challenges
   and other messages with a message authentication code in order to 
   provide message integrity protection along with mutual  
   authentication. 

   EAP/CAVE specifies optional support for protecting the privacy of 
   subscriber identity using the same concept as cdma, which is using 
   pseudonyms/temporary identifiers. 

   The security of EAP/CAVE builds on underlying cdma mechanisms. The 
   security properties of EAP/CAVE are documented in Section 9 of this 
   document.Implementers and users of EAP/CAVE are advised to carefully
   study the security considerations in Section 9 in order to determine 
   whether the security properties are sufficient for the environment 
   in question, especially as the secrecy of CEMA keys is key to the 
   security of EAP/CAVE. In brief, EAP/CAVE is in no sense weaker than 
   the cdma mechanisms. In some cases EAP/CAVE provides better security 
   properties than the underlying cdma mechanisms, particularly if the 
   UIM credentials are only used for EAP/CAVE and not re-used from 
   cdma. Many of the security features of EAP_CAVE rely upon the 
   secrecy of the CMEA values, so protecting this values is key to 
   the security of the EAP-CAVE protocol. In any case, if the cdma 
   authentication mechanisms are considered to be sufficient 
   for use on the cellular networks, then EAP/CAVE is expected to be 
   sufficiently secure for other networks. 

2. Terms 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in [RFC 2119]. 

   The terms and abbreviations "authenticator", "backend authentication 
   server", "EAP server", "Silently Discard", "Master Session Key 
   (MSK)", and "Extended Master Session Key (EMSK)" in this document 
   are to be interpreted as described in [EAP]. 

   This document frequently uses the following terms and abbreviations: 

   AAA protocol 

      Authentication, Authorization and Accounting protocol 

   AC 

      Authentication Centre. The cdma network element that manages the
      authentication information related to the subscriber.
      

Lizhiming                                         [Page 4]

Internet Draft          EAP CAVE Authentication        15 April, 2004    
     
   A-Key
      A 64-bit cryptographic key stored in the mobile station and 
      AC, it is used to generate or update the mobiel station's SSD. 
   
   AUTHBS
      Authentication response of the RANDBS challenge from the AC,which
      together with the RANDSSD authenticates the network to the peer, 
      24bits. 

   AUTHR
      Authentication response of the global challenge from the peer,
      which together with the RANDU authenticates the peer to the server, 
      24bits. 

   AUTHU
      Authentication response of the unique challenge from the peer, 
      which together with the RAND authenticates the peer to the server, 
      24bits. 

   cdma 

      Code Division Multiple Access. 

   CAVE 

      Cellular Message Encryption Algorithm used in the cdma system. 

   EAP 

      Extensible Authentication Protocol. 
      
   ESN

      A 32-bit number assigned by the mobile station manufacturer, 
      uniquely identifying the mobile station equipment.      

   IMSI

      International Mobile Subscriber Identifier, used in cdma to 
      identify subscribers. 

   MAC 

      Message Authentication Code 

   NAI 
      Network Access Identifier 

   Permanent Identity 

      The permanent identity of the peer,including an NAI realm portion
      in environments where a realm is used. The permanent identity is 
      usually based on the IMSI. Used on full authentication only. 

Lizhiming                                         [Page 5]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   Permanent Username 

      The username portion of permanent identity, ie. not including any 
      realm portions.  

   Pseudonym Identity 

      A pseudonym identity of the peer, including an NAI realm portion 
      in environments where a real is used. Used on full authentication 
      only. 

   Pseudonym Username 

      The username portion of pseudonym identity, ie. not including any
      realm portions. 
      
   RAND
      Random number generated by the AC or EAP server, 32 bits.

   RANDBS
      Random number generated by the peer for network authentication 
      in SSD update procedure, 32 bits.

   RANDSSD
      Random number generated by the AC for updating SSD currently 
      stored at the peer and the AC, 56 bits.

   RANDU
      Random number generated by the EAP server for unique challenge, 
      24 bits.

   SSD
      Shared Secret Data consists of SSD_A and SSD_B,128bits.

   SSD_A
      Shared Secret Data_A used for authentication response
      calculation, 64bits.
   
   SSD_B
      Shared Secret Data_B used for encryption information derivation,
      64bits.
   
   UIM 

      Universal Identity Module. The UIM is an application 
      traditionally resident on smart cards distributed by cdma 
      operators. 

3. Overview 

   Figure 1 shows an overview of the EAP/CAVE full authentication 
   procedure. The authenticator typically communicates with an EAP 
   server that is located on a backend authentication server using an 

Lizhiming                                         [Page 6]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   AAA protocol. The AAA communications is not shown in the figure. 

   The first EAP Request issued by the network is EAP-Request/Identity. 
   On full authentication, the peer's response includes either the 
   user's International Mobile Subscriber Identity (IMSI) or a 
   temporary identity (pseudonym) if identity privacy is in effect, as 
   specified in Section 4.2. 

   Following the peer's EAP-Response/Identity packet, the peer receives
   EAP Requests of type xx (UIM) from the EAP server and sends the 
   corresponding EAP Responses. The EAP packets that are of the Type 
   UIM also have a Subtype field. On full authentication, the first 
   EAP-Request/UIM packet is of the Subtype xx(Start). EAP CAVE packets
   encapsulate parameters in attributes, encoded in a Type, Length, 
   Value format. The packet format and the use of attributes are 
   specified in Section 5. 

   The EAP-Request/UIM/Start packet contains the list of EAP/UIM 
   version supported by the EAP server in the AT_VERSION_LIST 
   attribute. This packet may also include attributes for requesting 
   the subscriber identity, as specified in Section 4.2. 

   The peer responds to EAP-Request/UIM/Start with the EAP-
   Response/UIM/Start packet, which includes the AT_NONCE_MT attribute 
   that contains a random number NONCE_MT, chosen by the peer, the 
   AT_SELECTED_VERSION attribute that contains the version number 
   selected by the peer, and the AT_ESN attribute that contains the
   ESN of the peer. The version negotiation is protected by 
   including the version list and the selected version in the 
   calculation of keying material (Section 4.7). 

   After receiving the EAP Response/UIM/Start, the EAP server stores 
   the ESN value and determins which kind of challenge will be used 
   for full authentication. If global chanllenge is slected, the EAP 
   server generates a fresh random number RAND. If unique challenge is
   selected, the EAP server interacts with AC to get authentication
   vector including RANDU and AUTHU.

   The next EAP Request the EAP Server issues is of the type UIM and 
   subtype Challenge (11). It contains the RAND or RANDU challenges and
   a message authentication code attribute AT_MAC to cover the 
   challenges.

   On receipt of the EAP-Request/UIM/Challenge message, the peer runs 
   the cave algorithm and calculates a copy of the message 
   authentication code. The peer then verifies that the calculated MAC
   equals the received MAC. If the MAC's do not match, then the peer 
   sends the EAP-Response/UIM/Client-Error packet and the 
   authentication exchange terminates. 

   Since the RAND or RANDU given to a peer are accompanied with the 
   message authentication code AT_MAC, and since the peer's NONCE_MT 
   value contributes to AT_MAC, the peer is able to verify that the 

Lizhiming                                         [Page 7]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   EAP CAVE message is fresh (not a replay).  

   If all checks out, the peer responds with the EAP-
   Response/UIM/Challenge. If the peer receives the AT_RAND attribute,
   the EAP-Response/UIM/Challenge contains the AT_MAC attribute and 
   AT_AUTHR attribute. If the peer receive the AT_RANDU attribute,
   the EAP-Response/UIM/Challenge contains the AT_MAC attribute that 
   covers the peer's AUTHU response values (Section 6.4). 
   
   On receipt of the EAP-Response/UIM/Challenge message,The EAP server 
   verifies the MAC. If unique challenge is used, the EAP server can 
   get authentication result directly through check the MAC. If global
   challenge is used, the EAP server gets AUTHR value from the EAP-
   Response/UIM/Challenge message. The EAP server sends random number 
   RAND and response AUTHR to the AC for verification of the 
   subscriber, and obtain authentication result and encryption 
   informaiton(including CMEA key) and SSD information from the AC.

   From the encryption information and SSD information, the EAP 
   server derives the keying material, as specified in Section 4.7. 
   
   If authenticatin is successful, the EAP server sends the EAP-Success
   packet, indicating that the authentication was successful.If 
   authentication fails, the EAP server may notify the AC the failure 
   of authentication, the AC may initates a SSD update procedure when
   the AC determins to execute SSD update procedure. If authentication
   successes, the EAP server may notify the AC the authentication 
   result and get SSD information from the AC.


























Lizhiming                                         [Page 8]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

     Peer                                               Authenticator 
       |                                                          | 
       |                               EAP-Request/Identity       | 
       |<---------------------------------------------------------| 
       | EAP-Response/Identity                                    | 
       |--------------------------------------------------------->| 
       |                        EAP-Request/UIM/Start             | 
       |                        (AT_VERSION_LIST)                 | 
       |<---------------------------------------------------------| 
       | EAP-Response/UIM/Start                                   | 
       | (AT_NONCE_MT, AT_SELECTED_VERSION, AT_ESN)               | 
       |--------------------------------------------------------->| 
       |               EAP-Request/UIM/Challenge                  | 
       |               (AT_RAND or AT_RANDU, AT_MAC)              | 
       |<---------------------------------------------------------| 
       |                                                          | 
   +-------------------------------------+                        | 
   | Peer runs CAVE algorithms,          |                        | 
   | verifies AT_MAC, derives            |                        | 
   | AUTHR or AUTHU and session keys     |                        | 
   +-------------------------------------+                        | 
       |                                                          | 
       | EAP-Response/UIM/Challenge                               | 
       | (AT_MAC, AUTHR)                                          | 
       |--------------------------------------------------------->| 
       |                        +-------------------------------------+
       |                        | Server checks the response          |
       |                        | and MAC, if success,   derives      |                         
       |                        | session keys                        |                         
       |                        +-------------------------------------+                         
       |                                             EAP-Success  | 
       |<---------------------------------------------------------| 
       |                                                          | 

   Figure 1 EAP/CAVE full authentication procedure

   EAP CAVE also includes a separate re-authentication procedure. which
   use the Shared Secret Data shared in the server. Re-authentication 
   is based on keys derived on full authentication. 
   If the peer has maintained state information for re-authentication 
   and wants to use re-authentication, then the peer indicates this by 
   using a specific re-authentication identity instead of the permanent 
   identity or a pseudonym identity. The re-authentication procedure is 
   described in Section 4.3. 

   EAP CAVE also includes a separate update procedure, which handle the
   asynchronous SSD between the peer and the AC. When the AC determins 
   that the SSD currently stored at the peer should be update,the EAP 
   server executes SSD update procedure as described in section 4.4.
   




Lizhiming                                         [Page 9]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

4. Operation 

4.1. Version Negotiation 

   EAP/CAVE includes version negotiation so as to allow future 
   developments in the protocol. The version negotiation is performed 
   on full authentication and it uses two attributes, AT_VERSION_LIST, 
   which the server always includes in EAP-Request/UIM/Start, and 
   AT_SELECTED_VERSION, which the peer includes in EAP-
   Response/UIM/Start on full authentication. 

   AT_VERSION_LIST includes the EAP/UIM versions supported by the 
   server. If AT_VERSION_LIST does not include a version that is 
   implemented by the peer and allowed in the peer's security policy, 
   then the peer MUST send the EAP-Response/UIM/Client-Error packet 
   (Section 6.13) to the server with the error code "unsupported 
   version". If a suitable version is included, then the peer includes 
   the AT_SELECTED_VERSION attribute, containing the selected version, 
   in the EAP-Response/UIM/Start packet. The peer MUST only indicate a 
   version that is included in AT_VERSION_LIST. If several versions are 
   acceptable, then the peer SHOULD choose the version that occurs 
   first in the version list. 

   The version number list of AT_VERSION_LIST and the selected version 
   of AT_SELECTED_VERSION are included in the key derivation procedure 
   (Section 4.7). If an attacker modifies either one of these 
   attributes, then the peer and the server derive different keying 
   material. Because K_aut keys are different, the server and peer 
   calculate different AT_MAC values. Hence, the peer detects that 
   AT_MAC included in EAP-Request/UIM/Challenge is incorrect and sends 
   the EAP-Response/UIM/Client-Error packet. The authentication 
   procedure terminates. 

4.2. Identity Management 

4.2.1 Format, Generation and Usage of Peer Identities 

General 

   In the beginning of EAP authentication, the Authenticator or the EAP 
   server usually issues the EAP-Request/Identity packet to the peer. 
   The peer responds with EAP-Response/Identity, which contains the 
   user's identity. The formats of these packets are specified in 
   [EAP]. 

   cdma subscribers are identified with the International Mobile 
   Subscriber Identity (IMSI) [3GPP2 N.S0009]. The IMSI is composed of
   a three digit Mobile Country Code (MCC),a two or three digit Mobile
   Network Code (MNC) and a not more than 10 digit Mobile Subscriber 
   Identification Number (MSIN). In other words, the IMSI is a string 
   of not more than 15 digits. MCC and MNC uniquely identify the cdma 
   operator and  help identify the AC from which the authentication 
   result need to be obtained for this subscriber. 

Lizhiming                                         [Page 10]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


   Internet AAA protocols identify users with the Network Access 
   Identifier (NAI) [RFC 2486]. When used in a roaming environment, the 
   NAI is composed of a username and a realm, separated with "@" 
   (username@realm). The username portion identifies the subscriber 
   within the realm. 

   This section specifies the peer identity format used in EAP/CAVE.In 
   this document, the term identity or peer identity refers to the 
   whole identity string that is used to identify the peer. The peer 
   identity may include a realm portion. "Username" refers to the 
   portion of the peer identity that identifies the user, i.e. the 
   username does not include the realm portion. 

Identity Privacy Support 

   EAP/CAVE includes optional identity privacy (anonymity) support that
   can be used to hide the cleartext permanent identity and thereby to 
   make the subscriber's EAP exchanges untraceable to eavesdroppers. 
   Because the permanent identity never changes, revealing it would 
   help observers to track the user. The permanent identity is usually 
   based on the IMSI, which may further help the tracking, because the 
   same identifier may used in other contexts as well. Identity privacy 
   is based on temporary identities, or pseudonyms, which are 
   equivalent to but separate from the Temporary Mobile Subscriber 
   Identities (TMSI) that are used on cellular networks. Please see 
   Section 9.1 for security considerations regarding identity privacy. 

Username Types in EAP/CAVE identities 

   There are three types of usernames in EAP/CAVE peer identities:  

   (1) Permanent usernames. For example, 
   1123456789098765@myoperator.com might be a valid permanent identity. 
   In this example, 1123456789098765 is the permanent username.  

   (2) Pseudonym usernames. For example, 3s7ah6n9q@myoperator.com might 
   be a valid pseudonym identity. In this example, 3s7ah6n9q is the 
   pseudonym username. 

   (3) Re-authentication usernames. For example, 
   53953754a@myoperator.com might be a valid re-authentication 
   identity. In this case, 53953754 is the re-authentication username. 

   The first two types of identities are only used on full 
   authentication and the last one only on re-authentication. When the 
   optional identity privacy support is not used, the non-pseudonym 
   permanent identity is used on full authentication. The re-
   authentication exchange is specified in Section 4.3. 





Lizhiming                                         [Page 11]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

Username Decoration 

   In some environments, the peer may need to decorate the identity by 
   prepending or appending the username with a string, in order to 
   indicate supplementary AAA routing information in addition to the 
   NAI realm. (The usage of a NAI realm portion is not considered to be 
   decoration.) Username decoration is out of the scope of this 
   document. However, it should be noted that username decoration might 
   prevent the server from recognizing a valid username. Hence, 
   although the peer MAY use username decoration in the identities the 
   peer includes in EAP-Response/Identity, and the EAP server MAY 
   accept a decorated peer username in this message, the peer or the 
   EAP server MUST NOT decorate any other peer identities that are used 
   in various EAP/CAVE attributes. Only the identity used in EAP-
   Response/Identity may be decorated. 

NAI Realm Portion 

   The peer MAY include a realm portion in the peer identity, as per 
   the NAI format. The use of a realm portion is not mandatory. 

   If a realm is used, the realm MAY be chosen by the operator and it 
   MAY a configurable parameter in the EAP/CAVE peer implementation.In 
   this case, the peer is typically configured with the NAI realm of 
   the home operator. Operators MAY reserve a specific realm name for 
   EAP/CAVE users. This convention makes it easy to recognize that the 
   NAI identifies a cdma subscriber. Such reserved NAI realm may be 
   useful as a hint as to the first authentication method to use during 
   method negotiation. When the peer is using a pseudonym username 
   instead of the permanent username, the peer selects the realm name 
   portion similarly as it select the realm portion when using the 
   permanent username. 

   If no configured realm name is available, the peer MAY derive the 
   realm name from the MCC and MNC portions of the IMSI. A recommended 
   way to derive the realm from the IMSI using the realm 
   3gpp2network.org will be specified in 3GPP2. 
   Alternatively, the realm name may be obtained by concatenating 
   "mnc", the MNC digits of IMSI, ".mcc", the MCC digits of IMSI and 
   ".owlan.org". For example, if the IMSI is 123456789098765, and the 
   MNC is three digits long, then the derived realm name is 
   "mnc456.mcc123.owlan.org". 

   The IMSI is a string of digits without any explicit structure, so 
   the peer may not be able to determine the length of the MNC portion. 
   If the peer is not able to determine whether the MNC is two or three 
   digits long, the peer MAY use a 3-digit MNC. If the correct length 
   of the MNC is two, then the MNC used in the realm name includes the 
   first digit of MSIN. Hence, when configuring AAA networks for 
   operators that have 2-digit MNC's, the network SHOULD also be 
   prepared for realm names with incorrect 3-digit MNC's. 



Lizhiming                                         [Page 12]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

Format of the Permanent Username 

   The non-pseudonym permanent username SHOULD be derived from the 
   IMSI. In this case, the permanent username MUST be of the format "1" 
   | IMSI, where the character "|" denotes concatenation. In other 
   words, the first character of the username is the digit one (ASCII 
   value 0x31), followed by the IMSI. The IMSI is an ASCII string that 
   consists of not more than 15 decimal digits (ASCII values between 
   0x30 and 0x39) as specified in [3GPP2 N.S0009]. 

   The EAP server MAY use the leading "1" as a hint to try EAP/CAVE as 
   the first authentication method during method negotiation, rather 
   than for example EAP/AKA. The EAP/CAVE server MAY propose EAP/CAVE 
   even if the leading character was not "1". 

   Alternatively, an implementation MAY choose a permanent username 
   that is not based on the IMSI. In this case the selection of the 
   username, its format, and its processing is out of the scope of this 
   document. In this case, the peer implementation MUST NOT prepend any 
   leading characters to the username. 

Generating Pseudonyms and Re-authentication Identities by the Server 

   Pseudonym usernames and re-authentication identities are generated 
   by the EAP server. The EAP server produces pseudonym usernames and 
   re-authentication identities in an implementation-dependent manner. 
   Only the EAP server needs to be able to map the pseudonym username 
   to the permanent identity, or to recognize a re-authentication 
   identity. Regardless of construction method, the pseudonym username 
   MUST conform to the grammar specified for the username portion of an 
   NAI. The re-authentication identity also MUST conform to the NAI 
   grammar. The EAP servers that the subscribers of an operator can use 
   MUST ensure that the pseudonym usernames and the username portions 
   used in re-authentication identities they generate are unique. 

   In any case, it is necessary that permanent usernames, pseudonym 
   usernames and re-authentication usernames are separate and 
   recognizable from each other. 

   In general, it is the task of the EAP server and the policies of its 
   administrator to ensure sufficient separation in the usernames. 
   Pseudonym usernames and re-authentication usernames are both 
   produced and used by the EAP server. The EAP server MUST compose 
   pseudonym usernames and re-authentication usernames so that it can 
   recognize if a NAI username is an EAP CAVE pseudonym username or an 
   EAP CAVE re-authentication username. For instance, when the usernames 
   have been derived from the IMSI, the server could use different 
   leading characters in the pseudonym usernames and re-authentication 
   usernames (e.g. the pseudonym could begin with a leading "3" 
   character). When mapping a re-authentication identity to a permanent 
   identity, the server SHOULD only examine the username portion of the 
   re-authentication identity and ignore the realm portion of the 
   identity. 

Lizhiming                                         [Page 13]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


   Because the peer may fail to save a pseudonym username sent to in an 
   EAP-Request/UIM/Challenge, for example due to malfunction, the EAP 
   server SHOULD maintain at least one old pseudonym username in 
   addition to the most recent pseudonym username. 

Transmitting Pseudonyms and Re-authentication Identities to the Peer 

   The server transmits pseudonym usernames and re-authentication 
   identities to the peer in cipher, using the AT_ENCR_DATA attribute. 

   The EAP-Request/UIM/Challenge message MAY include an encrypted 
   pseudonym username and/or an encrypted re-authentication identity in 
   the value field of the AT_ENCR_DATA attribute. Because identity 
   privacy support and re-authentication are optional to implement, the 
   peer MAY ignore the AT_ENCR_DATA attribute and always use the 
   permanent identity. On re-authentication (discussed in Section 4.3), 
   the server MAY include a new encrypted re-authentication identity in 
   the EAP-Request/SIM/Re-authentication message. 

   On receipt of the EAP-Request/UIM/Challenge, the peer MAY decrypt 
   the encrypted data in AT_ENCR_DATA and if a pseudonym username is 
   included, the peer may use the obtained pseudonym username on the 
   next full authentication. If a re-authentication identity is 
   included, then the peer MAY save it and other re-authentication 
   state information, as discussed in Section 4.3, for the next re-
   authentication.  

   If the peer does not receive a new pseudonym username in the EAP-
   Request/UIM/Challenge message, the peer MAY use an old pseudonym 
   username instead of the permanent username on next full 
   authentication. The username portions of re-authentication 
   identities are one-time usernames, which the peer MUST NOT re-use. 

 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 




Lizhiming                                         [Page 14]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

Usage of the Re-authentication Identity by the Peer 

   On re-authentication, the peer uses the re-authentication identity, 
   received as part of the previous authentication sequence. A new re-
   authentication identity may be delivered as part of both full 
   authentication and re-authentication. The peer MUST NOT modify the 
   username part of the re-authentication identity received in 
   AT_NEXT_REAUTH_ID, except in cases when username decoration is 
   required. Even in these cases, the "root" re-authentication username 
   must not be modified, but it may be appended or prepended with 
   another string. 

4.2.2 Communicating the Peer Identity to the Server 

General 

   The peer identity MAY be communicated to the server with the EAP-
   Response/Identity message. This message MAY contain the permanent 
   identity, a pseudonym identity, or a re-authentication identity. If 
   the peer uses the permanent identity or a pseudonym identity, which 
   the server is able to map to the permanent identity, then the 
   authentication proceeds as discussed in the overview of Section 3. 
   If the peer uses a re-authentication identity, and the server 
   recognized the identity and agrees on using re-authentication, then 
   a re-authentication exchange is performed, as described in 4.3. 

   The peer identity can also be transmitted from the peer to the 
   server using EAP/CAVE messages instead of EAP-Response/Identity. In 
   this case, the server includes an identity requesting attribute 
   (AT_ANY_ID_REQ, AT_FULLAUTH_ID_REQ or AT_PERMANENT_ID_REQ) in the 
   EAP-Request/UIM/Start message, and the peer includes the AT_IDENTITY 
   attribute, which contains the peer's identity, in the EAP-
   Response/UIM/Start message. The AT_ANY_ID_REQ attribute is a general 
   identity requesting attribute, which the server uses if it does not 
   specify which kind of an identity the peer should return in 
   AT_IDENTITY. The server uses the AT_FULLAUTH_ID_REQ attribute to 
   request either the permanent identity or a pseudonym identity. The 
   server uses the AT_PERMANENT_ID_REQ attribute to request the peer to 
   send its permanent identity. 

   The identity format in the AT_IDENTITY attribute is the same as in 
   the EAP-Response/Identity packet (except that identity decoration is 
   not allowed). The AT_IDENTITY attribute contains a permanent 
   identity, a pseudonym identity or a re-authentication identity. 

   Obtaining the subscriber identity via EAP/CAVE messages is useful if 
   the server does not have any EAP/CAVE peer identity at the beginning 
   of the EAP/CAVE exchange or does not recognize the identity the peer 
   used in EAP-Response/Identity.  This may happen if, for example, the 
   EAP-Response/Identity has been issued by some EAP method other than 
   EAP/CAVE or if intermediate entities or software layers in the peer 
   have modified the identity string in the EAP-Response/Identity 
   packet. Also, some EAP layer implementations may cache the identity 

Lizhiming                                         [Page 15]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   string from the first EAP authentication and do not obtain a new 
   identity string from the EAP method implementation on subsequent 
   authentication exchanges. 

   As the identity string is used in key derivation, any of these cases 
   will result in failed authentication unless the EAP server uses 
   EAP/CAVE attributes to obtain an unmodified copy of the identity 
   string.  Therefore, unless the EAP server can be certain that no 
   intermediate element or software layer has modified the EAP-
   Response/Identity packet, the EAP server SHOULD always use the 
   EAP/CAVE attributes to obtain the identity, even if the identity 
   received in EAP-Response/Identity was valid. 

   Please note that the EAP/CAVE peer and the EAP/CAVE server only 
   process the AT_IDENTITY attribute and entities that only pass 
   through EAP packets do not process this attribute. Hence, if the EAP 
   server is not co-located in the authenticator, then the 
   authenticator and other intermediate AAA elements (such as possible 
   AAA proxy servers) will continue to refer to the peer with the 
   original identity from the EAP-Response/Identity packet regardless 
   of whether the AT_IDENTITY attribute is used in EAP/CAVE to transmit 
   another identity. 

Choice of Identity for the EAP-Response/Identity 

   If EAP/CAVE peer is started upon receiving an EAP-Request/Identity 
   message, then the peer performs the following steps. 

   If the peer has maintained re-authentication state information and 
   if the peer wants to use re-authentication, then the peer transmits 
   the re-authentication identity in EAP-Response/Identity. 

   Else, if the peer has a pseudonym username available, then the peer 
   transmits the pseudonym identity in EAP-Response/Identity. 

   In other cases, the peer transmits the permanent identity in EAP-
   Response/Identity. 

Server Operation in the Beginning of EAP/CAVE Exchange 

   If the EAP server has not received any identity (permanent identity, 
   pseudonym identity or re-authentication identity) from the peer when 
   sending the first EAP/CAVE request, or if the EAP server has received 
   an EAP-Response/Identity packet but the contents do not appear to be 
   a valid permanent identity, pseudonym identity or a re-
   authentication identity, then the server MUST request an identity 
   from the peer using one of the methods below. 

   The server sends the EAP-Request/UIM/Start message with the 
   AT_PERMANENT_ID_REQ message to indicate that the server wants the 
   peer to include the permanent identity in the AT_IDENTITY attribute 
   of the EAP-Response/SIM/Start message. This is done in the following 
   cases: 

Lizhiming                                         [Page 16]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   - The server does not support re-authentication or identity privacy. 

   - The server received an identity that it recognizes as a pseudonym 
   identity but the server is not able to map the pseudonym identity to 
   a permanent identity. 

   The server issues the EAP-Request/UIM/Start packet with the 
   AT_FULLAUTH_ID_REQ attribute to indicate that the server wants the 
   peer to include a full authentication identity (pseudonym identity 
   or permanent identity) in the AT_IDENTITY attribute of the EAP-
   Response/UIM/Start message.  This is done in the following cases: 

   - The server does not support re-authentication and the server 
   supports identity privacy 

   - The server received an identity that it recognizes as a re-
   authentication identity but the server is not able to map the re-
   authentication identity to a permanent identity 

   The server issues the EAP-Request/UIM/Start packet with the 
   AT_ANY_ID_REQ attribute to indicate that the server wants the peer 
   to include an identity in the AT_IDENTITY attribute of the EAP-
   Response/UIM/Start message, and the server does not indicate any 
   preferred type for the identity. This is done in other cases, such 
   as when the server does not have any identity, or the server does 
   not recognize the format of a received identity. 

Processing of EAP-Request/SIM/Start by the Peer 

   Upon receipt of an EAP-Request/UIM/Start message, the peer MUST 
   perform the following steps. 

   If the EAP-Request/UIM/Start does not include any identity request 
   attribute, then the peer responds with EAP-Response/UIM/Start 
   without AT_IDENTITY. The peer includes the AT_SELECTED_VERSION, 
   AT_NONCE_MT attributes and AT_ESN attribute, because the exchange 
   is a full authentication exchange. 

   If the EAP-Request/UIM/Start includes AT_PERMANENT_ID_REQ the peer 
   MUST either respond with EAP-Response/UIM/Start and include the 
   permanent identity in AT_IDENTITY and AT_ESN attribute or respond 
   with EAP-Response/UIM/Client-Error packet with code "unable to 
   process packet". 

   If the EAP-Request/UIM/Start includes AT_FULL_AUTH_ID_REQ, and if 
   the peer has a pseudonym available, then the peer SHOULD respond 
   with EAP-Response/UIM/Start and includes the pseudonym identity in 
   AT_IDENTITY. If the peer does not have a pseudonym when it receives 
   this message, then the peer MUST either respond with EAP-
   Response/UIM/Start and include the permanent identity in AT_IDENTITY 
   and AT_ESN attribute or respond with EAP-Response/UIM/Client-Error 
   packet with code "unable to process packet." The Peer MUST NOT use 
   a re-authentication identity in the AT_IDENTITY attribute. 

Lizhiming                                         [Page 17]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   If the EAP-Request/UIM/Start includes AT_ANY_ID_REQ, and if the peer 
   has maintained re-authentication state information and the peer 
   wants to use re-authentication, then the peer responds with EAP-
   Response/UIM/Start and includes the re-authentication identity in 
   AT_IDENTITY. Else, if the peer has a pseudonym identity available, 
   then the peer responds with EAP-Response/UIM/Start and includes the 
   pseudonym identity in AT_IDENTITY. Else, the peer responds with EAP-
   Response/UIM/Start and includes the permanent identity in 
   AT_IDENTITY and AT_ESN attribute. 

   An EAP/CAVE exchange may include several EAP/UIM/Start rounds. The 
   server may issue a second EAP-Request/UIM/Start, if it was not able 
   to recognize the identity the peer used in the previous AT_IDENTITY 
   attribute. At most three EAP/UIM/Start rounds can be used. 
   AT_ANY_ID_REQ can only be used in the first EAP-Request/UIM/Start, 
   in other words AT_ANY_ID_REQ MUST NOT be used in the second or third 
   EAP-Request/SIM/Start. AT_FULLAUTH_ID_REQ MUST NOT be used if the 
   previous EAP-Request/UIM/Start included AT_PERMANENT_ID_REQ. The 
   peer operation in cases when it receives an unexpected attribute is 
   specified in Section 4.6.1. 
   
   AT_ESN attribute must not be included if a pseudonym identity or a 
   re-authentication identity is contained in the 
   EAP-Response/UIM/Start message.

Attacks against Identity Privacy 

   The section above specifies two possible ways the peer can operate 
   upon receipt of AT_PERMANENT_ID_REQ. This is because a received 
   AT_PERMANENT_ID_REQ does not necessarily originate from the valid 
   network, but an active attacker may transmit an EAP-
   Request/UIM/Start packet with an AT_PERMANENT_ID_REQ attribute to 
   the peer, in an effort to find out the true identity of the user. If 
   the peer does not want to reveal its permanent identity, then the 
   peer sends the EAP-Response/UIM/Client-Error packet with the error 
   code "unable to process packet", and the authentication exchange 
   terminates.  

   Basically, there are two different policies that the peer can employ 
   with regard to AT_PERMANENT_ID_REQ. A "conservative" peer assumes 
   that the network is able to maintain pseudonyms robustly. Therefore, 
   if a conservative peer has a pseudonym username, the peer responds 
   with EAP-Response/UIM/Client-Error to the EAP packet with 
   AT_PERMANENT_ID_REQ, because the peer believes that the valid 
   network is able to map the pseudonym identity to the peer's 
   permanent identity. (Alternatively, the conservative peer may accept 
   AT_PERMANENT_ID_REQ in certain circumstances, for example if the 
   pseudonym was received a long time ago.) The benefit of this policy 
   is that it protects the peer against active attacks on anonymity. On 
   the other hand, a "liberal" peer always accepts the 
   AT_PERMANENT_ID_REQ and responds with the permanent identity. The 
   benefit of this policy is that it works even if the valid network 


Lizhiming                                         [Page 18]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   sometimes loses pseudonyms and is not able to map them to the 
   permanent identity. 

Processing of AT_IDENTITY by the Server 

   When the server receives an EAP-Response/UIM/Start message with the 
   AT_IDENTITY (in response to the server's identity requesting 
   attribute), the server MUST operate as follows. 

   If the server used AT_PERMANENT_ID_REQ, and if the AT_IDENTITY does 
   not contain a valid permanent identity, then the server sends EAP 
   Failure and the EAP exchange terminates. If the server recognizes 
   the permanent identity and is able to continue, then the server 
   proceeds with full authentication by sending EAP-
   Request/UIM/Challenge. 

   If the server used AT_FULLAUTH_ID_REQ, and if AT_IDENTITY contains a 
   valid permanent identity or a pseudonym identity that the server can 
   map to a valid permanent identity, then the server proceeds with 
   full authentication by sending EAP-Request/UIM/Challenge. If 
   AT_IDENTITY contains a pseudonym identity that the server is not 
   able to map to a valid permanent identity, or an identity that the 
   server is not able to recognize or classify, then the server sends 
   EAP-Request/UIM/Start with AT_PERMANENT_ID_REQ. 

   If the server used AT_ANY_ID_REQ, and if the AT_IDENTITY contains a 
   valid permanent identity or a pseudonym identity that the server can 
   map to a valid permanent identity, then the server proceeds with 
   full authentication by sending EAP-Request/UIM/Challenge. 

   If the server used AT_ANY_ID_REQ, and if AT_IDENTITY contains a 
   valid re-authentication identity and the server agrees on using re-
   authentication, then the server proceeds with re-authentication by 
   sending EAP-Request/UIM/Re-authentication (Section 4.3). 

   If the server used AT_ANY_ID_REQ, and if the peer sent an EAP-
   Response/UIM/Start with only AT_IDENTITY (indicating re-
   authentication), but the server is not able to map the identity to a 
   permanent identity, then the server sends EAP-Request/UIM/Start with 
   AT_FULLAUTH_ID_REQ. 

   If the server used AT_ANY_ID_REQ, and if AT_IDENTITY contains a 
   valid re-authentication identity, which the server is able to map to 
   a permanent identity, and if the server does not want to use re-
   authentication, then the server sends EAP-Request/UIM/Start without 
   any identity requesting attributes. 

   If the server used AT_ANY_ID_REQ, and AT_IDENTITY contains an 
   identity that the server recognizes as a pseudonym identity but the 
   server is not able to map the pseudonym identity to a permanent 
   identity, then the server sends EAP-Request/UIM/Start with 
   AT_PERMANENT_ID_REQ. 


Lizhiming                                         [Page 19]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


   If the server used AT_ANY_ID_REQ, and AT_IDENTITY contains an 
   identity that the server is not able to recognize or classify, then 
   the server sends EAP-Request/UIM/Start with AT_FULLAUTH_ID_REQ. 

4.2.3 Message Sequence Examples (Informative) 

   This section contains non-normative message sequence examples to 
   illustrate how the peer identity can be communicated to the server. 

Full Authentication 

   This case for full authentication is illustrated in the figure 
   below. In this case, AT_IDENTITY contains either the permanent 
   identity or a pseudonym identity. The same sequence is also used in 
   case the server uses the AT_FULLAUTH_ID_REQ in EAP-
   Request/UIM/Start. 

       Peer                                             Authenticator 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not have any     | 
          |                            | Subscriber identity available| 
          |                            | When starting EAP/CAVE       | 
          |                            +------------------------------+ 
          |                                                       | 
          |          EAP-Request/UIM/Start                        | 
          |          (AT_ANY_ID_REQ, AT_VERSION_LIST)             | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY, AT_NONCE_MT,                            | 
          |  AT_SELECTED_VERSION, AT_ESN)                         | 
          |------------------------------------------------------>| 
          |                                                       | 
    

   If the peer uses its full authentication identity and the 
   AT_IDENTITY attribute contains a valid permanent identity or a valid 
   pseudonym identity that the EAP server is able to map to the 
   permanent identity, then the full authentication sequence proceeds 
   as usual with the EAP Server issuing the EAP-Request/UIM/Challenge 
   message. AT_ESN attribute must not be included if a pseudomnym 
   identity is contained in the EAP-Response/UIM/Start message.









Lizhiming                                         [Page 20]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

Re-authentication 

   The case when the server uses the AT_ANY_ID_REQ and the peer wants 
   to perform re-authentication is illustrated below. 

       Peer                                             Authenticator 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not have any     | 
          |                            | Subscriber identity available| 
          |                            | When starting EAP/CAVE       | 
          |                            +------------------------------+ 
          |                                                       | 
          |        EAP-Request/UIM/Start                          | 
          |        (AT_ANY_ID_REQ, AT_VERSION_LIST)               | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY containing a re-authentication identity) | 
          |------------------------------------------------------>| 
          |                                                       | 
    
   On re-authentication, if the AT_IDENTITY attribute contains a valid 
   re-authentication identity and the server agrees on using re-
   authentication, then the server proceeds with the re-authentication 
   sequence and issues the EAP-Request/SIM/Re-authentication packet, as 
   specified in Section 4.3.  

   
   
   
   
   
   
   
   
   
   
   
   
   
   
   
   
   
   
   
   





Lizhiming                                         [Page 21]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


Fall Back to Full Authentication 

   The case when the server does not recognize the re-authentication 
   identity the peer used in AT_IDENTITY, and issues a second EAP-
   Request/UIM/Start message is illustrated below.  

        Peer                                             Authenticator 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not have any     | 
          |                            | Subscriber identity available| 
          |                            | When starting EAP/CAVE       | 
          |                            +------------------------------+ 
          |                                                       | 
          |        EAP-Request/UIM/Start                          | 
          |        (AT_ANY_ID_REQ, AT_VERSION_LIST)               | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY containing a re-authentication identity) | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not recognize    | 
          |                            | The re-authentication        | 
          |                            | Identity                     | 
          |                            +------------------------------+ 
          |                                                       | 
          |     EAP-Request/UIM/Start                             | 
          |     (AT_FULLAUTH_ID_REQ, AT_VERSION_LIST)             | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY with a full-auth. identity, AT_NONCE_MT, | 
          |  AT_SELECTED_VERSION, AT_ESN)                         | 
          |------------------------------------------------------>| 
          |                                                       | 
    













Lizhiming                                         [Page 22]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

Requesting the Permanent Identity 1 

   The figure below illustrates the case when the EAP server fails to 
   map the pseudonym identity included in the EAP-Response/Identity 
   packet to a valid permanent identity. 

       Peer                                             Authenticator 
          |                                                       | 
          |                               EAP-Request/Identity    | 
          |<------------------------------------------------------| 
          |                                                       | 
          | EAP-Response/Identity                                 | 
          | (Includes a pseudonym)                                | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server fails to map the      | 
          |                            | Pseudonym to a permanent id. | 
          |                            +------------------------------+ 
          |                                                       | 
          |  EAP-Request/UIM/Start                                | 
          |  (AT_PERMANENT_ID_REQ, AT_VERSION_LIST)               | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY with permanent identity, AT_NONCE_MT,    | 
          |  AT_SELECTED_VERSION, AT_ESN)                         | 
          |------------------------------------------------------>| 
          |                                                       | 
    
   If the server recognizes the permanent identity, then the 
   authentication sequence proceeds as usual with the EAP Server 
   issuing the EAP-Request/UIM/Challenge message.  




















Lizhiming                                         [Page 23]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


Requesting the Permanent Identity 2 

   The figure below illustrates the case when the EAP server fails to 
   map the pseudonym included in the AT_IDENTITY attribute to a valid 
   permanent identity. 

       Peer                                             Authenticator 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not have any     | 
          |                            | Subscriber identity available| 
          |                            | When starting EAP/CAVE       | 
          |                            +------------------------------+ 
          |                                                       | 
          |        EAP-Request/UIM/Start                          | 
          |        (AT_ANY_ID_REQ, AT_VERSION_LIST)               | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          |EAP-Response/UIM/Start                                 | 
          |(AT_IDENTITY with a pseudonym identity, AT_NONCE_MT,   | 
          | AT_SELECTED_VERSION)                                  | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                                                       | 
          |                           +-------------------------------+ 
          |                           | Server fails to map the       | 
          |                           | Pseudonym in AT_IDENTITY      | 
          |                           | to a valid permanent identity | 
          |                           +-------------------------------+ 
          |                                                       | 
          |                EAP-Request/UIM/Start                  | 
          |                (AT_PERMANENT_ID_REQ, AT_VERSION_LIST) | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY with permanent identity,                 | 
          |  AT_NONCE_MT, AT_SELECTED_VERSION, AT_ESN)            | 
          |------------------------------------------------------>| 
          |                                                       | 
    











Lizhiming                                         [Page 24]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

Three EAP/UIM/Start Roundtrips 

   In the worst case, there are three EAP/UIM/Start round trips before 
   the server has obtained an acceptable identity. This case is 
   illustrated below.  

         Peer                                             Authenticator 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not have any     | 
          |                            | Subscriber identity available| 
          |                            | When starting EAP/CAVE        | 
          |                            +------------------------------+ 
          |                                                       | 
          |        EAP-Request/UIM/Start                          | 
          |        (Includes AT_ANY_ID_REQ, AT_VERSION_LIST)      | 
          |<------------------------------------------------------| 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY with re-authentication identity)         | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                            +------------------------------+ 
          |                            | Server does not accept       | 
          |                            | The re-authentication        | 
          |                            | Identity                     | 
          |                            +------------------------------+ 
          |                                                       | 
          |     EAP-Request/UIM/Start                             | 
          |     (AT_FULLAUTH_ID_REQ, AT_VERSION_LIST)             | 
          |<------------------------------------------------------| 
          |                                                       | 
          |EAP-Response/UIM/Start                                 | 
          |(AT_IDENTITY with a pseudonym identity, AT_NONCE_MT,   | 
          | AT_SELECTED_VERSION)                                  | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                           +-------------------------------+ 
          |                           | Server fails to map the       | 
          |                           | Pseudonym in AT_IDENTITY      | 
          |                           | to a valid permanent identity | 
          |                           +-------------------------------+ 
          |                                                       | 
          |           EAP-Request/UIM/Start                       | 
          |           (AT_PERMANENT_ID_REQ, AT_VERSION_LIST)      | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
          | EAP-Response/UIM/Start                                | 
          | (AT_IDENTITY with permanent identity, AT_NONCE_MT,    | 
          |  AT_SELECTED_VERSION,AT_ESN)                          | 
          |------------------------------------------------------>| 
          |                                                       | 
    


Lizhiming                                         [Page 25]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   After the last EAP-Response/UIM/Start message, the full 
   authentication sequence proceeds as usual. If the EAP Server 
   recognizes the permanent identity and is able to proceed, the server 
   issues the EAP-Request/UIM/Challenge message.  

4.3. Re-Authentication 

4.3.1 General 

   In some environments, EAP authentication may be performed 
   frequently. Because the EAP CAVE full authentication procedure 
   requires the authentication informatin from the Authentication 
   Centre, the full authentication procedure is not very well suitable 
   for frequent use. Therefore, EAP CAVE includes a re-authentication 
   procedure that does not need new authenticaiton and encryption
   information from the Authentication Centre. Re-
   authentication can be performed in fewer roundtrips than the full 
   authentication.
   
   After a succesful full authentication, the Authentication Center 
   should share the Shared Secret Data with the Server. In following
   re-authentication procedure, the server can locally perform global
   challenge or unique challenge without interaction with the 
   Authentication Center.

   Re-authentication is optional to implement for both the EAP CAVE 
   server and peer. On each EAP authentication, either one of the 
   entities may also fall back on full authentication if they do not 
   want to use re-authentication. 

   Re-authentication is based on the keys derived on the preceding full 
   authentication. The same K_aut and K_encr keys as in full 
   authentication are used to protect EAP CAVE packets and attributes, 
   and the original Master Key from full authentication is used to 
   generate a fresh Master Session Key, as specified in Section 4.7.  

   In order to use re-authentication, the peer and the EAP server need 
   to store the following values: Master Key and the next 
   re-authentication identity. K_aut, K_encr may either be 
   stored or derived again from MK. The server may also need to store 
   the permanent identity of the user. 
 
4.3.2 Re-authentication Identity 

   The re-authentication procedure makes use of separate re-
   authentication user identities. Pseudonyms and the permanent 
   identity are reserved for full authentication only. If a re-
   authentication identity is lost and the network does not recognize 
   it, the EAP server can fall back on full authentication. 



Lizhiming                                         [Page 26]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   If the EAP server supports re-authentication, it MAY include the 
   skippable AT_NEXT_REAUTH_ID attribute in the encrypted data of EAP-
   Request/UIM/Challenge message (Section 6.3). This attribute contains 
   a new re-authentication identity for the next re-authentication. The 
   peer MAY ignore this attribute, in which case it MUST use full 
   authentication next time. If the peer wants to use re-
   authentication, it uses this re-authentication identity on next 
   authentication. Even if the peer has a re-authentication identity, 
   the peer MAY discard the re-authentication identity and use a 
   pseudonym or the permanent identity instead, in which case full 
   authentication MUST be performed. 

   In environments where a realm portion is needed in the peer 
   identity, the re-authentication identity received in 
   AT_NEXT_REAUTH_ID MUST contain both a username portion and a realm 
   portion, as per the NAI format. The EAP Server can choose an 
   appropriate realm part in order to have the AAA infrastructure route 
   subsequent re-authentication related requests to the same AAA 
   server. For example, the realm part MAY include a portion that is 
   specific to the AAA server. Hence, it is sufficient to store the 
   context required for re-authentication in the AAA server that 
   performed the full authentication. 

   The peer MAY use the re-authentication identity in the EAP-
   Response/Identity packet or, in response to server's AT_ANY_ID_REQ 
   attribute, the peer MAY use the re-authentication identity in the 
   AT_IDENTITY attribute of the EAP-Response/SIM/Start packet. The peer 
   MUST NOT modify the username portion of the re-authentication 
   identity, but the peer MAY modify the realm portion or replace it 
   with another realm portion. 

   Even if the peer uses a re-authentication identity, the server may 
   want to fall back on full authentication, for example because the 
   server does not recognize the re-authentication identity or does not 
   want to use re-authentication. In this case, the server starts the 
   full authentication procedure by issuing an EAP-Request/UIM/Start 
   packet. This packet always starts a full authentication sequence if 
   it does not include the AT_ANY_ID_REQ attribute. If the server was 
   not able to recover the peer's identity from the re-authentication 
   identity, the server includes either the AT_FULLAUTH_ID_REQ or the 
   AT_PERMANENT_ID_REQ attribute in this EAP request.  













Lizhiming                                         [Page 27]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

4.3.3 Re-authentication Procedure 

   The following figure illustrates the re-authentication procedure. 
   Encrypted attributes are denoted with '*'. The peer uses its re-
   authentication identity in the EAP-Response/Identity packet. As 
   discussed above, an alternative way to communicate the re-
   authentication identity to the server is for the peer to use the 
   AT_IDENTITY attribute in the EAP-Response/UIM/Start message. This 
   latter case is not illustrated in the figure below, and it is only 
   possible when the server requests the peer to send its identity by 
   including the AT_ANY_ID_REQ attribute in the EAP-Request/UIM/Start 
   packet. 

   If the server recognizes the re-authentication identity and agrees 
   on using re-authentication, then the server firstly determins which 
   way of challenge, e.g. global challenge or unique challenge, will 
   be used, generates a corresponding fresh random number RAND or 
   RANDU as challenge, then sends the EAP-Request/UIM/Re-authentication
   packet to the peer. The EAP server also runs CAVE algorithm to 
   produce coresponding response AUTHR or AUTHU. This packet MUST 
   include the encrypted AT_RAND or AT_RANDU attribute that contains a 
   random number chosen by the server, the AT_ENCR_DATA and the AT_IV 
   attributes used for encryption, and the AT_MAC attribute that 
   contains a message authentication code over the packet. The packet 
   MAY also include an encrypted AT_NEXT_REAUTH_ID attribute that 
   contains the next re-authentication identity.  

   Re-authentication identities are one-time identities. If the peer 
   does not receive a new re-authentication identity, it MUST use 
   either the permanent identity or a pseudonym identity on the next 
   authentication to initiate full authentication. 

   The peer verifies that AT_MAC is correct. The peer MAY save the next
   re-authentication identity from the encrypted AT_NEXT_REAUTH_ID for 
   next time. The peer takes RAND or RANDU value as input of CAVE 
   algorithm to produce response AUTHR or AUTHU. The peer also 
   calculates a new MAC covering the packet concatenated to the AUTHR 
   or AUTHU. The peer responds with the EAP-Response/UIM/Re-
   authentication packet. 

   The server verifies the AT_MAC attribute. If the checks is 
   successful, the re-authentication has succeeded and the server 
   sends the EAP-Success packet to the peer. 











Lizhiming                                         [Page 28]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

       Peer                                             Authenticator 
          |                                                       | 
          |                               EAP-Request/Identity    | 
          |<------------------------------------------------------| 
          |                                                       | 
          | EAP-Response/Identity                                 | 
          | (Includes a re-authentication identity)               | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                          +--------------------------------+ 
          |                          | Server recognizes the identity | 
          |                          | and agrees on using fast       | 
          |                          | re-authentication. Server      | 
          |			     | determins global challenge or  |
          |			     | unique challenge is used, then |
          |			     | generates random number RAND   |
          |			     | (global challenge)or RANDU     |
          |			     | (unique challenge)    	      |
          |                          +--------------------------------+ 
          |                                                       | 
          |  EAP-Request/UIM/Re-authentication                    | 
          |  (AT_IV, AT_ENCR_DATA, *AT_RAND or *AT_RANDU,         | 
          |   *AT_NEXT_REAUTH_ID, AT_MAC)                         | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
     +-----------------------------------------------+            | 
     | Peer verifies AT_MAC and runs CAVE algorithm  |            | 
     | to calculate response AUTH or AUTHU. Peer MAY |            | 
     | store the new re-authentication identity      | 		  |
     | for next re-auth.    			     |            | 
     +-----------------------------------------------+            | 
          |                                                       | 
          | EAP-Response/UIM/Re-authentication                    | 
          | (AT_IV, AT_ENCR_DATA, AT_MAC)		          | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                          +--------------------------------+ 
          |                          | Server verifies AT_MAC         | 
          |                          +--------------------------------+ 
          |                                                       | 
          |                                          EAP-Success  | 
          |<------------------------------------------------------| 
          |                                                       | 
    









Lizhiming                                         [Page 29]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

4.4. EAP/CAVE SSD Update

   In full authentication, the Authentication Center may determins 
   that the SSD stored at the peer must be updated if the full-
   authenticaiton failed. The following figure illustrates the 
   SSD update procedure. 

   On SSD Update, the server obtains the RANDSSD challenge and a pair 
   of parameter RANDU and AUTHU from the AC. The server sends this 
   challenge in AT_RANDSSD attribute of the EAP-Request/UIM/Update 
   packet containing the AT_MAC attribute to the peer. 
   
   When the peer receive this challenge, the peer check the AT_MAC. If 
   check is successful and the the peer agrees to start SSD update 
   procedure,the peer runs CAVE algorithm to generate a new pending SSD, 
   then generates a new random number RANDBS as a challenge for 
   network. The peer runs CAVE algorithm again to calculate the 
   corresponding response AUTHBS.
   
   The peer responds the server with a EAP-response/UIM/Update-Server-
   challenge packet containing the AT_RANDBS and AT_MAC attribute.
   
   The server verifies the AT_MAC attribute, then forwards the RANDBS
   value to the AC and obtains the response AUTHB from the AC. The 
   server responds with the EAP-request/UIM/Update-Server-challenge, 
   containing the AT_MAC attribute covering the packet concatenated to
   the AUTHBS values.
   
   The peer checks the AT_MAC attribute.If check is successful, the 
   peer updates the SSD of UIM with the pending SSD, and responds to 
   the server with EAP-response/UIM/Update-Client-success packet 
   containing AT_MAC attribute and AT_Update_Success_indication 
   attribute indicating the ssd update success of the peer.
   
   The server verifies the AT_MAC attribute and checks the peer's AT_
   SSD_Update_Success attibute. If these check are succesful, the 
   server sends EAP-request/UIM/Update-challenge packet to the peer, 
   which contains AT_RANDU attribute as a challenge to the peer and
   AT_MAC attribute.
   
   The peer checks the AT_MAC attribute and runs CAVE algorithm to 
   calculate the response AUTHU, then the peers responds with EAP-
   response/UIM/Update-challenge packet containing AT_MAC attribute 
   that cover the AUTHU value.
   
   The server verifies the AT_MAC attribute. If the 
   checks are successful, the server notifies the AC that the SSD 
   update procedure has been successfully completed and obtains the 
   new SSD value from the AC, then the server sends the EAP-Success 
   packet to the peer.




Lizhiming                                         [Page 30]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

       Peer                                             Authenticator 
          |                                                       | 
          |                                                       | 
          |                  +----------------------------------------+ 
          |                  | Based on the SSD update information    | 
          |		     | received from the AC, the server       |
          |		     | agrees to start SSD update procedure   |
          |		     | and gets the corresponding parameter   |
          |		     | including RANDSSD,RAND,AUTHU from the  |
          |		     | Authencation Center.		      |
          |                  +----------------------------------------+ 
          |                                                       | 
          |  EAP-Request/UIM/Update                               | 
          |  (AT_RANDSSD,AT_MAC)	          		  | 
          |<------------------------------------------------------| 
          |                                                       | 
          |                                                       | 
     +-----------------------------------------------+            | 
     | Peer verifies AT_MAC and runs CAVE algorithm  |            |
     | to calculate the new SSD, then the peer 	     |		  |
     | generates a fresh random number RANDBS, runs  |		  |
     | CAVE algorithm again to calculate AUTHBS.     |            | 
     | Peer must keep the old SSD if SSD update      |		  |
     | fail.					     |            | 
     +-----------------------------------------------+            | 
          |                                                       | 
          | EAP-Response/UIM/Update-Server-challenge              | 
          | (AT_RANDBS, AT_MAC)				          | 
          |------------------------------------------------------>| 
          |                          +--------------------------------+ 
          |                          | Server verifies AT_MAC ,       | 
          |                          | forwards RANDBS value to the   | 
          |			     | AC, and obtain response AUTHBS |
          |			     | from the AC		      |
          |                          +--------------------------------+ 
          |                                                       | 
          |                                                       | 
          |  EAP-Request/UIM/Update-Server-challenge              | 
          |  (AT_MAC)			  			  | 
          |<------------------------------------------------------| 
     +-----------------------------------------------+            | 
     | Peer verifies AT_MAC, if success, 	     |		  |
     | Peer update SSD, then send success message    |            |
     +-----------------------------------------------+            | 
          |                                                       | 
          | EAP-Response/UIM/Update-Client-success                | 
          | (AT_SSD_Update_Success, AT_MAC)	  		  | 
          |------------------------------------------------------>| 
          |                                                       | 
          |                                                       | 




Lizhiming                                         [Page 31]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

          |                                                       | 
          |                                                       | 
          |                          +--------------------------------+ 
          |                          | Server verifies AT_MAC and     | 
          |                          | SSD Update Success indication. | 
          |                          +--------------------------------+ 
          |  EAP-Request/UIM/Update-challenge                     | 
          |  (AT_RANDU,	AT_MAC)				          | 
          |<------------------------------------------------------| 
     +-----------------------------------------------+            | 
     | Peer verifies AT_MAC and runs CAVE algorithm  |            |
     | to calculate AUTHU			     |            |
     +-----------------------------------------------+            | 
          | EAP-Response/UIM/Update-challenge                	  | 
          | (AT_MAC)					          | 
          |------------------------------------------------------>| 
          |                          +--------------------------------+ 
          |                          | Server verifies AT_MAC.        | 
          |			     |  Server notifies the AC        |
          |			     | the success of SSD Updating,   |
          |			     | and gets new SSD from the AC   |
          |                          +--------------------------------+ 
          |                                                       | 
          |                                          EAP-Success  | 
          |<------------------------------------------------------| 
          |                                                       | 
    

4.5. EAP/CAVE Notifications 

   The EAP-Request/Notification, specified in [EAP], can be used to 
   convey a displayable message from the EAP server to the peer. 
   Because these messages are textual messages, it may be hard for the 
   peer to present them in the user's preferred language. Therefore, 
   EAP/CAVE uses a separate EAP/CAVE message subtype to transmit 
   localizable notification codes instead of the EAP-
   Request/Notification packet. 

   The EAP server MAY issue an EAP-Request/UIM/Notification packet to 
   the peer. The peer MAY show a notification message to the user and 
   the peer MUST respond to the EAP server with an EAP-
   Response/UIM/Notification packet, even if the peer did not recognize 
   the notification code. 

   The notification code is a 16-bit number. The most significant bit 
   is called the Failure bit (F bit). The F bit specifies whether the 
   notification implies failure. The code values with the F bit set to 
   zero (code values 0...32767) are used on unsuccessful cases. The 
   receipt of a notification code from this range implies failed 
   authentication, so the peer can use the notification as a failure 
   indication. After receiving the EAP-Response/UIM/Notification for 
   these notification codes, the server MUST send the EAP-Failure 
   packet. 

Lizhiming                                         [Page 32]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   The receipt of a notification code with the F bit set to one (values 
   32768...65536) does not imply failure, so the peer MUST NOT change 
   its state when it receives such a notification. (This version of the 
   protocol does not specify any notification codes with the F bit set 
   to one.) 

   The second most significant bit of the notification code is called 
   the Phase bit (P bit). It specifies at which phase of the EAP/CAVE 
   exchange the notification can be used. If the P bit is set to zero, 
   the notification can only be used after the EAP/CAVE/Challenge round 
   in full authentication or the EAP/CAVE/Re-authentication round in 
   reautentication. For these notifications, the AT_MAC attribute MUST 
   be included in both EAP-Request/UIM/Notification and EAP-
   Response/UIM/Notification. 

   If the P bit is set to one, the notification can only by used before 
   the EAP/CAVE/Challenge round in full authentication or the 
   EAP/CAVE/Re-authentication round in reauthentication. For these 
   notifications, the AT_MAC attribute MUST NOT be included in either 
   EAP-Request/UIM/Notification or EAP-Response/UIM/Notification. (This 
   version of the protocol does not specify any notification codes with 
   the P bit set to one.) 

   Some of the notification codes are authorization related and hence 
   not usually considered as part of the responsibility of an EAP 
   method. However, they are included as part of EAP/CAVE because there 
   are currently no other ways to convey this information to the user 
   in a localizable way, and the information is potentially useful for 
   the user. An EAP/CAVE server implementation may decide never to send 
   these EAP/CAVE notifications. 

4.6. Error Cases 

   This section specifies the operation of the peer and the server in 
   error cases. The subsections below require the EAP/CAVE peer and 
   server to send an error packet (EAP-Response/UIM/Client-Error or EAP 
   Failure) in error cases. However, implementations SHOULD NOT rely 
   upon the correct error reporting behavior of the peer, 
   authenticator, or the server.  It is possible for error and other 
   messages to be lost in transit or for a malicious participant to 
   attempt to consume resources by not issuing error messages.  Both 
   the peer and the EAP server SHOULD have a mechanism to clean up 
   state even if an error message or EAP Success is not received after 
   a timeout period. 

4.6.1 Peer Operation 

   In general, if an EAP/CAVE peer detects an error in a received 
   EAP/CAVE packet, the EAP/CAVE implementation responds with the EAP-
   Response/UIM/Client-Error packet. In response to the EAP-
   Response/UIM/Client-Error, the EAP server MUST issue the EAP Failure 
   packet and the authentication exchange terminates.  


Lizhiming                                         [Page 33]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


   By default, the peer uses the client error code 0, "unable to 
   process packet". This error code is used in the following cases: 

   - the peer is not able to parse the EAP request, i.e. the EAP 
   request is malformed 

   - the peer encountered a malformed attribute 

   - wrong attribute types or duplicate attributes have been included 
   in the EAP request 

   - a mandatory attribute is missing 

   - unrecognized non-skippable attribute 

   - unrecognized or unexpected EAP/CAVE Subtype in the EAP request 

   - A RAND challenge repeated in AT_RAND 

   - invalid AT_MAC 

   - invalid pad bytes in AT_PADDING 

   - the peer does not want to process AT_PERMANENT_ID_REQ 

   Separate error codes have been defined for the following error cases 
   in Section 7.18.

   As specified in Section 4.1, when processing the AT_VERSION_LIST 
   attribute, which lists the EAP/CAVE versions supported by the server, 
   if the attribute does not include a version that is implemented by 
   the peer and allowed in the peer's security policy, then the peer 
   MUST send the EAP-Response/UIM/Client-Error packet with the error 
   code "unsupported version". 

   If the peer believes that the RAND challenges included in AT_RAND 
   are not fresh e.g. because it is capable of remembering some 
   previously used RANDs, the peer MUST send the EAP-
   Response/UIM/Client-Error packet with the error code "RAND are not 
   fresh". 

4.6.2 Server Operation 

   If an EAP/CAVE server detects an error in a received EAP/CAVE 
   response, the server MUST issue the EAP Failure packet and the 
   authentication exchange terminates. The errors cases when the server 
   issues an EAP Failure include the following: 

   - the server is not able to parse the peer's EAP response 

   - the server encounters a malformed attribute, a non-recognized non-
   skippable attribute, or a duplicate attribute 

Lizhiming                                         [Page 34]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   - a mandatory attribute is missing or an invalid attribute was 
   included 

   - unrecognized or unexpected EAP/CAVE Subtype in the EAP Response 

   - invalid AT_MAC 


4.6.3 EAP Failure  

   As normally in EAP, the EAP server sends the EAP-Failure packet to 
   the peer when the authentication procedure fails on the EAP Server. 
   In EAP/CAVE, this may occur for example if the EAP server does not 
   recognize the peer identity, or if the EAP server is not able to 
   obtain the cdma authentication informatin for the subscriber or 
   the authentication exchange times out. The server may also send 
   EAP Failure if there is an error in the received EAP/CAVE 
   response, as discussed in Section 4.6.2. 

   The server can send EAP-Failure at any time in the EAP exchange. The 
   peer MUST process EAP-Failure. 

4.6.4 EAP Success 

   On full authentication, the server can only send EAP-Success after 
   the EAP/CAVE/Challenge round. The peer MUST silently discard any EAP-
   Success packets if they are received before the peer has 
   successfully authenticated the server and sent the EAP-
   Response/UIM/Challenge packet. 

   On re-authentication, EAP-Success can only be sent after the 
   EAP/CAVE/Re-authentication round. The peer MUST silently discard any 
   EAP-Success packets if they are received before the peer has 
   successfully authenticated the server and sent the EAP-
   Response/UIM/Re-authentication packet. 

   On SSD Update, EAP-Success can only be sent after the 
   EAP/CAVE/Update round. The peer MUST silently discard any 
   EAP-Success packets if they are received before the peer has 
   successfully authenticated the server and sent the EAP-
   Response/UIM/Update-Challenge packet. 

   If the peer receives an EAP/CAVE notification (section 4.5) that 
   indicates failure, then the peer MUST no longer accept the EAP-
   Success packet even if the server authentication was successfully 
   completed. 

4.7. Key Generation 

   This section specifies how keying material is generated. 




Lizhiming                                         [Page 35]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   On EAP CAVE full authentication and SSD Update procedure, a Master 
   Key (MK) is derived from the underlying cdma encryption information
   (CMEA keys), the NONCE_MT and other relevant context as follows. 

   MK = SHA1(Identity|CMEA | NONCE_MT| Version List| Selected Version) 

   In the formula above, the "|" character denotes concatenation. 
   Identity denotes the peer identity string without any terminating 
   null characters. It is the identity from the AT_IDENTITY attribute 
   from the last EAP-Response/UIM/Start packet, or, if AT_IDENTITY was 
   not used, the identity from the EAP-Response/Identity packet. The 
   identity string is included as-is, without any changes and including 
   the possible identity decoration. The notation CMEA denotes the CMEA 
   key value, which is derived from SSD_B based on CAVE algorithm 
   [3GPP2 N.S0005]. NONCE_MT denotes the NONCE_MT value (not the 
   AT_NONCE_MT attribute but just the nonce value). The 
   Version List includes the 2-byte supported version numbers from 
   AT_VERSION_LIST, in the same order as in the attribute. The Selected 
   Version is the 2-byte selected version from AT_SELECTED_VERSION. 
   Network byte order is used, just as in the attributes. The hash 
   function SHA-1 is specified in [SHA-1]. If several EAP/UIM/Start 
   roundtrips are used in an EAP/CAVE exchange, then the NONCE_MT, 
   Version List and Selected version from the last EAP/UIM/Start round
   are used, and the previous EAP/UIM/Start rounds are ignored. 

   The Master Key is fed into a Pseudo-Random number Function (PRF) 
   which generates separate Transient EAP Keys (TEKs) for protecting 
   EAP CAVE packets, as well as a Master Session Key (MSK) for link 
   layer security and an Extended Master Session Key (EMSK) for other 
   purposes. On re-authentication, the same TEKs MUST be used for 
   protecting EAP packets, but a new MSK and a new EMSK MUST be derived 
   from the original MK and new values exchanged in the re-
   authentication. 

   EAP CAVE requires two TEKs for its own purposes, the authentication 
   key K_aut to be used with the AT_MAC attribute, and the encryption 
   key K_encr, to be used with the AT_ENCR_DATA attribute. The same 
   K_aut and K_encr keys are used in full authentication and subsequent 
   re-authentications.  
    
   Key derivation is based on the random number generation specified in 
   NIST Federal Information Processing Standards (FIPS) Publication 
   186-2 [PRF]. The pseudo-random number generator is specified in the 
   change notice 1 (2001 October 5) of [PRF] (Algorithm 1). As 
   specified in the change notice (page 74), when Algorithm 1 is used 
   as a general-purpose pseudo-random number generator, the "mod q" 
   term in step 3.3 is omitted. The function G used in the algorithm is 
   constructed via Secure Hash Standard as specified in Appendix 3.3 of 
   the standard. It should be noted that the function G is very similar 
   to SHA-1, but the message padding is different. Please refer to 
   [PRF] for full details. For convenience, the random number algorithm 
   with the correct modification is cited in Annex B.  
    

Lizhiming                                         [Page 36]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   160-bit XKEY and XVAL values are used, so b = 160. On each full 
   authentication, the Master Key is used as the initial secret seed-
   key XKEY. The optional user input values (XSEED_j) in step 3.1 are 
   set to zero.  
    
   The resulting 320-bit random numbers x_0, x_1, ..., x_m-1 are 
   concatenated and partitioned into suitable-sized chunks and used as 
   keys in the following order: K_encr (128 bits), K_aut (128 bits), 
   Master Session Key (64 bytes), Extended Master Session Key (64 
   bytes). 
    
   On re-authentication, the same pseudo-random number generator can be 
   used to generate a new Master Session Key and new Initialization 
   Vectors. The seed value XKEY' is calculated as follows: 

      XKEY' = SHA1(Identity|RAND| MK) (1) or
      XKEY' = SHA1(Identity|RANDU| MK) (2)

   In the formula above, the formula selection is based on the type of 
   cdma challenge. The formula (1) is slected when the server determins
   that global challenge is used, the formula (2) is slected when the 
   server determins that unique challenge is used. The Identity denotes 
   the re-authentication identity, without any terminating null 
   characters, from the AT_IDENTITY attribute of the 
   EAP-Response/UIM/Start packet, or, if EAP-Response/UIM/Start was 
   not used on re-authentication, the identity string from the 
   EAP-Response/Identity packet. The RAND denotes the 32bits RAND value
   from the AT_RAND attribute used in the 
   EAP-Request/UIM/Re-authentication packet.The RANDU 
   denotes the 24bits RANDU value from the AT_RANDU attribute
   used in the EAP-Request/UIM/Re-authentication packet. The MK is 
   the Master Key derived on the preceding full authentication. 

   The pseudo-random number generator is run with the new seed value 
   XKEY', and the resulting 320-bit random numbers x_0, x_1, ..., 
   x_m-1 are concatenated and partitioned into 64-byte chunks and 
   used as the new 64-byte Master Session Key and the new 64-byte 
   Extended Master Session Key.  
    
   The first 32 bytes of the MSK can be used as the Pairwise Master Key 
   (PMK) for IEEE 802.11i. 

   When the RADIUS attributes specified in [RFC 2548] are used to 
   transport keying material, then the first 32 bytes of the MSK 
   correspond to MS-MPPE-RECV-KEY and the second 32 bytes to MS-MPPE-
   SEND-KEY. In this case, only 64 bytes of keying material (the MSK) 
   are used. 







Lizhiming                                         [Page 37]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

5. Message Format and Protocol Extensibility 

5.1. Message Format 

   As specified in [EAP], EAP packets begin with the Code, Identifiers, 
   Length, and Type fields, which are followed by EAP method specific 
   Type-Data. The Code field in the EAP header is set to 1 for EAP 
   requests, and to 2 for EAP Responses. The usage of the Length and 
   Identifier fields in the EAP header are also specified in [EAP]. In 
   EAP/CAVE, the Type field is set to xx.  

   In EAP/CAVE, the Type-Data begins with an EAP/CAVE header that 
   consists of a 1-octet Subtype field and a 2-octet reserved field. 
   The Subtype values used in EAP/CAVE are defined in Section 8. The 
   formats of the EAP header and the EAP/CAVE header are shown below. 

     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |     Code      |  Identifier   |            Length             | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |     Type      |    Subtype    |           Reserved            | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   The rest of the Type-Data, immediately following the EAP/CAVE header, 
   consists of attributes that are encoded in Type, Length, Value 
   format. The figure below shows the generic format of an attribute. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |      Type     |    Length     |  Value... 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   Attribute Type 

      Indicates the particular type of attribute. The attribute type 
      values are listed in Section 8. 

   Length 

      Indicates the length of this attribute in multiples of four 
      bytes. The maximum length of an attribute is 1024 bytes. The 
      length includes the Attribute Type and Length bytes. 

   Value 

      The particular data associated with this attribute. This field is 
      always included and it may be two or more bytes in length. The 
      type and length fields determine the format and length of the 
      value field. 


Lizhiming                                         [Page 38]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   Attributes numbered within the range 0 through 127 are called non-
   skippable attributes. When an EAP/CAVE peer encounters a non-
   skippable attribute that the peer does not recognize, the peer MUST 
   send the EAP-Response/UIM/Client-Error packet which terminates the 
   authentication exchange. If an EAP/CAVE server encounters a non-
   skippable attribute that the server does not recognize, then the 
   server sends the EAP Failure packet which terminates the 
   authentication exchange. 

   Attributes within the range of 128 through 255 are called skippable 
   attributes. When a skippable attribute is encountered that is not 
   recognized it is ignored. The rest of the attributes and message 
   data MUST still be processed. The Length field of the attribute is 
   used to skip the attribute value in searching for the next 
   attribute. 

   Unless otherwise specified, the order of the attributes in an 
   EAP/CAVE message is insignificant and an EAP/CAVE implementation 
   should not assume a certain order to be used. 

   Attributes can be encapsulated within other attributes. In other 
   words, the value field of an attribute type can be specified to 
   contain other attributes. 

5.2. Protocol Extensibility 

   EAP/CAVE can be extended by specifying new attribute types. If 
   skippable attributes are used, it is possible to extend the protocol 
   without breaking old implementations. However, any new attributes 
   added to the EAP-Request/UIM/Start or EAP-Response/UIM/Start packets 
   would not be integrity protected. Therefore, these messages MUST NOT 
   be extended in the current version of EAP/CAVE. 

   When specifying new attributes, it should be noted that EAP/CAVE does 
   not support message fragmentation. Hence, the sizes of the new 
   extensions MUST be limited so that the maximum transfer unit (MTU) 
   of the underlying lower layer is not exceeded. According to [EAP], 
   lower layers must provide an EAP MTU of 1020 bytes or greater, so 
   any extensions to EAP/CAVE SHOULD NOT exceed the EAP MTU of 1020 
   bytes. 

   Because EAP/CAVE supports version negotiation, new versions of the 
   protocol can also be specified by using a new version number. 

6. Messages 

   This section specifies the messages used in EAP/CAVE. It specifies 
   when a message may be transmitted or accepted, which attributes are 
   allowed in a message, which attributes are required in a message, 
   and other message specific details. The general message format is 
   specified in Section 5.1. 



Lizhiming                                         [Page 39]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

6.1. EAP-Request/UIM/Start 

   In full authentication the first CAVE specific EAP Request is EAP-
   Request/UIM/Start. The EAP/UIM/Start roundtrip is used for two 
   purposes. In full authentication this packet is used to request the 
   peer to send the AT_NONCE_MT attribute to the server. In addition, 
   as specified in Section 4.2, the Start round trip may be used by the 
   server for obtaining the peer identity and ESN value of the peer. 
   As discussed in Section 4.2, several Start rounds may be required 
   in order to obtain a valid peer identity. 

   The server MUST always include the AT_VERSION_LIST attribute. 

   The server MAY include one of the following identity requesting 
   attributes: AT_PERMANENT_ID_REQ, AT_FULLAUTH_ID_REQ, and 
   AT_ANY_ID_REQ. These three attributes are mutually exclusive, so the 
   server MUST NOT include more than one of the attributes.  

   If the server has received a response from the peer, it MUST NOT 
   issue a new EAP-Request/UIM/Start packet if it has either previously 
   issued an EAP-Request/UIM/Start message without any identity 
   requesting attributes or with the AT_PERMANENT_ID_REQ attribute. 

   If the server has received a response from the peer, it MUST NOT 
   issue a new EAP-Request/UIM/Start packet with the AT_ANY_ID_REQ or 
   AT_FULLAUTH_ID_REQ attributes if it has previously issued an EAP-
   Request/UIM/Start message with the AT_FULLAUTH_ID_REQ attribute 

   If the server has received a response from the peer, it MUST NOT 
   issue a new EAP-Request/UIM/Start packet with the AT_ANY_ID_REQ 
   attribute if the server has previously issued an EAP-
   Request/UIM/Start message with the AT_ANY_ID_REQ attribute. 

   This message MUST NOT include AT_MAC, AT_IV, or AT_ENCR_DATA. 

6.2. EAP-Response/UIM/Start 

   The peer sends EAP-Response/SIM/Start in response to a valid EAP-
   Request/SIM/Start from the server. 

   If and only if the server's EAP-Request/UIM/Start includes one of 
   the identity requesting attributes, then the peer MUST include the 
   AT_IDENTITY attribute. The usage of AT_IDENITY is defined in Section 
   4.2. 

   The AT_NONCE_MT attribute MUST NOT be included if the AT_IDENTITY 
   with a re-authentication identity is present for re-authentication. 
   AT_NONCE_MT MUST be included in all other cases (full 
   authentication).  
   




Lizhiming                                         [Page 40]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   The AT_ESN attribute must be including if the server's EAP-
   Request/UIM/Start do not include the identity requesting attribute
   or the permanent identity of the peer is included in the EAP-
   Response/UIM/Start packet.

   The AT_SELECTED_VERSION attribute MUST NOT be included if the 
   AT_IDENTITY attribute with a re-authentication identity is present 
   for re-authentication. In all other cases, AT_SELECTED_VERSION MUST 
   be included (full authentication). This attribute is used in version 
   negotiation, as specified in Section 4.1.  

   This message MUST NOT include AT_MAC, AT_IV, or AT_ENCR_DATA. 

6.3. EAP-Request/UIM/Challenge 

   The server sends the EAP-Request/UIM/Challenge after receiving a 
   valid EAP-Response/UIM/Start, containing AT_NONCE_MT, AT_ESN and 
   AT_SELECTED_VERSION, and after successfully obtaining the subscriber 
   identity.

   The AT_RAND or AT_RANDU attribute MUST be included. The selection of 
   the AT_RAND or AT_RANDU attribute is based on the way of challenge,
   i.e., global challenge or unique challenge is selected.

   The AT_MAC attribute MUST be included. For EAP-
   Request/UIM/Challenge, the MAC code is calculated over the following 
   data:  

   EAP packet| NONCE_MT 

   The EAP packet is represented as specified in Section 5.1. It is 
   followed by the 16-byte NONCE_MT value from the peer's AT_NONCE_MT 
   attribute. 

6.4. EAP-Response/UIM/Challenge 

   The peer sends EAP-Response/UIM/Challenge in response to a valid 
   EAP-Request/UIM/Challenge. 

   The AT_MAC attribute MUST be included. For EAP-
   Response/UIM/Challenge, when the AT_RANDU attribute is included in 
   the EAP_Request/UIM/Challenge, the MAC code is calculated over the 
   following data:  

   EAP packet| AUTHU

   The EAP packet is represented as specified in Section 5.1. The EAP 
   packet bytes are immediately followed by one AUTHU 
   values concatenated. The AUTHU is the response of AT_RANDU.
   
   For EAP-Response/UIM/Challenge, when the AT_RAND attribute is 
   included in the EAP_Request/UIM/Challenge,the MAC code is calculated
   over the EAP packet and AT_AUTHR attribute must be included.

Lizhiming                                         [Page 41]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

6.5. EAP-Request/UIM/Re-authentication 

   The server sends the EAP-Request/UIM/Re-authentication message if it 
   wants to use re-authentication, and if it has received a valid re-
   authentication identity in EAP-Response/Identity or EAP-
   Response/UIM/Start. 

   AT_MAC MUST be included. No message-specific data is included in the 
   MAC calculation. See Section 7.2. 
   
   The AT_IV and AT_ENCR_DATA attributes MUST be included. The 
   plaintext consists of the following nested encrypted attributes, 
   which MUST be included: AT_RANDU or AT_RAND. The selection of 
   the AT_RAND or AT_RANDU attribute is based on the way of challenge,
   i.e., global challenge or unique challenge is selected.In addition, 
   the nested encrypted attributes MAY include the following 
   attributes: AT_NEXT_REAUTH_ID and AT_PADDING. 

6.6. EAP-Response/UIM/Re-authentication 

   The client sends the EAP-Response/UIM/Re-authentication packet in 
   response to a valid EAP-Request/UIM/Re-authentication. 

   The AT_MAC attribute MUST be included. For EAP-Response/UIM/Re-
   authentication, the MAC code is calculated over the following data: 

    EAP packet| AUTHR or AUTHU

   The EAP packet is represented as specified in Section 5.1. It is 
   followed by the 3-byte AUTHR or AUTHU value, which is the response
   to the RAND or RANDU value. 

   The AT_IV and AT_ENCR_DATA attributes may be included. The 
   AT_PADDING attribute MAY be included. 

6.7. EAP-Request/UIM/Update
   The server sends the EAP-Request/UIM/Update if the server agree to
   executes SSD update procedure based on the received information from
   the Authentication Center.  

   AT_MAC MUST be included. No message-specific data is included in the 
   MAC calculation. See Section 7.2. 

   The AT_RANDSSD must be included.
   
6.8. EAP-Response/UIM/Update-server-challenge 

   The peer sends the EAP-Response/UIM/Update-server-challenge packet
   in response to a valid EAP-Request/UIM/Update. 

   AT_MAC MUST be included. No message-specific data is included in the 
   MAC calculation. See Section 7.2. 


Lizhiming                                         [Page 42]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   AT_RANDBS MUST be included. 

6.9. EAP-Request/UIM/Update-server-challenge 

   The server sends the EAP-Request/UIM/Update-server-challenge packet
   in response to a valid EAP-Response/UIM/Update-server-challenge. 

   The AT_MAC attribute MUST be included. For EAP-
   request/UIM/Update-server-challenge, the MAC code is calculated over 
   the following data:  

   EAP packet| AUTHBS

   The EAP packet is represented as specified in Section 5.1. The EAP 
   packet bytes are immediately followed by one AUTHBS which is 
   obtained from the Authentication Center. 

6.10. EAP-Response/UIM/Update-Client-Success 

   The peer sends the EAP-Response/UIM/Update-Client-Success packet
   in response to a valid EAP-Request/UIM/Update-server-challenge. 

   AT_MAC MUST be included. No message-specific data is included in the
   MAC calculation. See Section 7.2. 

   AT_SSD_UPDATE_SUCCESS MUST be included. 

6.11. EAP-Request/UIM/Update-challenge 

   The Server sends the EAP-Request/UIM/Update-challenge packet
   in response to a valid EAP-Response/UIM/Update-client-success. 

   AT_MAC MUST be included. No message-specific data is included in the 
   MAC calculation. See Section 7.2. 
   
   AT_RANDU MUST be included.    

6.12. EAP-Response/UIM/Update-challenge 

   The peer sends the EAP-Response/UIM/Update-challenge packet
   in response to a valid EAP-Request/UIM/Update-challenge. 

   The AT_MAC attribute MUST be included. For EAP-
   response/UIM/Update-challenge, the MAC code is calculated over 
   the following data:  

   EAP packet| AUTHU

   The EAP packet is represented as specified in Section 5.1. The EAP 
   packet bytes are immediately followed by one AUTHU values 
   concatenated. 



Lizhiming                                         [Page 43]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

6.13. EAP-Response/UIM/Client-Error 

   The peer sends EAP-Response/UIM/Client-Error in error cases, as 
   specified in Section 4.6.1. 

   The AT_CLIENT_ERROR_CODE attribute MUST be included. 

   The AT_MAC, AT_IV, or AT_ENCR_DATA attributes MUST NOT be used with 
   this packet. 

6.14. EAP-Request/UIM/Notification 

   The usage of this message is specified in Section 4.5. 

   The AT_NOTIFICATION attribute MUST be included.  

   The AT_MAC attribute is included in cases discussed in Section 4.5. 
   No message-specific data is included in the MAC calculation. See 
   Section 7.2. 

   Later versions of this protocol MAY make use of the AT_ENCR_DATA and 
   AT_IV attributes in this message to include encrypted (skippable) 
   attributes. These attributes MAY be included only if the P bit of 
   the notification code in AT_NOTIFICATION is set to zero. 

6.15. EAP-Response/UIM/Notification 

   The usage of this message is specified in Section 4.5. Because this 
   packet is only an acknowledgement of EAP-Request/UIM/Notification, 
   it does not contain any mandatory attributes. 

   The AT_MAC attribute is included in cases described in Section 4.5. 
   No message-specific data is included in the MAC calculation, see 
   Section 7.2. 

   Later versions of this protocol MAY make use of the AT_ENCR_DATA and 
   AT_IV attributes in this message to include encrypted (skippable) 
   attributes. These attributes MAY be included only if the P bit of 
   the notification code in the AT_NOTIFICATION attribute of the 
   server's EAP-Request/UIM/Notification packet is set to zero. 

7. Attributes 

   This section specifies the format of message attributes. The 
   attribute type numbers are specified in Section 8. 









Lizhiming                                         [Page 44]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.1. Table of Attributes 

   The following table provides a guide to which attributes may be 
   found in which kinds of messages, and in what quantity. Messages are 
   denoted with numbers in parentheses as follows: (1) EAP-
   Request/UIM/Start, (2) EAP-Response/UIM/Start, (3) EAP-
   Request/UIM/Challenge, (4) EAP-Response/UIM/Challenge, (5) EAP-
   Request/UIM/Notification, (6) EAP-Response/UIM/Notification, (7) 
   EAP-Response/UIM/Client-Error,(8) EAP-Request/UIM/Re-authentication,
   (9) EAP-Response/UIM/Re-authentication, (10) EAP-Request/UIM/Update,
   (11) EAP-Response/UIM/Update-Server-challenge, (12) EAP-Request/UIM/
   Update-Server-Challenge, (13) EAP-Response/UIM/Update-Client-Success
   , (14) EAP-Request/UIM/Update-Challenge and (15) EAP-Response/UIM/
   Update-Challenge. The column denoted with 
   "Encr" indicates whether the attribute is a nested attribute that 
   MUST be included within AT_ENCR_DATA, and the column denoted with 
   "Skip" indicates whether the attribute is a skippable attribute. 

   "0" indicates that the attribute MUST NOT be included in the 
   message, "1" indicates that the attribute MUST be included in the 
   message, "0-1" indicates that the attribute is sometimes included in 
   the message, and "0*" indicates that the attribute is not included 
   in the message in cases specified in this document, but MAY be 
   included in the future versions of the protocol. 

              Attribute (1) (2) (3) (4) (5) (6) (7) (8) (9)  Encr Skip 
                 AT_MAC  0   0   1   1  0-1 0-1  0   1   1   N     N   
                  AT_IV  0   0   0   0   0*  0*  0   1   1   N     Y 
           AT_ENCR_DATA  0   0   0   0   0*  0*  0   1   1   N     Y 
             AT_PADDING  0   0   0   0   0*  0*  0  0-1 0-1  Y     N 
        AT_VERSION_LIST  1   0   0   0   0   0   0   0   0   N     N 
    AT_SELECTED_VERSION  0  0-1  0   0   0   0   0   0   0   N     N 
            AT_NONCE_MT  0  0-1  0   0   0   0   0   0   0   N     N 
    AT_PERMANENT_ID_REQ 0-1  0   0   0   0   0   0   0   0   N     N 
          AT_ANY_ID_REQ 0-1  0   0   0   0   0   0   0   0   N     N 
     AT_FULLAUTH_ID_REQ 0-1  0   0   0   0   0   0   0   0   N     N 
            AT_IDENTITY  0  0-1  0   0   0   0   0   0   0   N     N 
                AT_RAND  0   0  0-1  0   0   0   0  0-1  0   N     N 
               AT_RANDU  0   0   0   0   0   0   0  0-1  0   N     N 
             AT_RANDSSD  0   0   0   0   0   0   0   0   0   N     N 
              AT_RANDBS  0   0   0   0   0   0   0   0   0   N     N 
                 AT_ESN  0  0-1  0   0   0   0   0   0   0   N     N 
               AT_AUTHR  0   0   0  0-1  0   0   0   0   0   N     N 
      AT_NEXT_PSEUDONYM  0   0   0   0   0   0   0   0   0   N     N 
      AT_NEXT_REAUTH_ID  0   0   0   0   0   0   0  0-1  0   Y     Y 
        AT_NOTIFICATION  0   0   0   0   1   0   0   0   0   N     N 
   AT_CLIENT_ERROR_CODE  0   0   0   0   0   0   1   0   0   N     N 
   AT_SSD_UPDATE_SUCCESS 0   0   0   0   0   0   0   0   0   N     N 






Lizhiming                                         [Page 45]

Internet Draft          EAP CAVE Authentication        15 April, 2004    
    
               Attribute (10)(11)(12)(13)(14)(15) Encr  Skip   
                  AT_MAC  1   1   1   1   1   1     N     N          
                   AT_IV  0   0   0   0   0   0     N     N          
            AT_ENCR_DATA  0   0   0   0   0   0     N     N          
              AT_PADDING  0   0   0   0   0   0     N     N          
         AT_VERSION_LIST  0   0   0   0   0   0     N     N          
     AT_SELECTED_VERSION  0   0   0   0   0   0     N     N          
             AT_NONCE_MT  0   0   0   0   0   0     N     N          
     AT_PERMANENT_ID_REQ  0   0   0   0   0   0     N     N          
           AT_ANY_ID_REQ  0   0   0   0   0   0     N     N          
      AT_FULLAUTH_ID_REQ  0   0   0   0   0   0     N     N          
             AT_IDENTITY  0   0   0   0   0   0     N     N          
                 AT_RAND  0   0   0   0   0   0     N     N          
                AT_RANDU  0   0   0   0   1   0     N     N          
              AT_RANDSSD  1   0   0   0   0   0     N     N          
               AT_RANDBS  0   1   0   0   0   0     N     N          
                  AT_ESN  0   0   0   0   0   0     N     N 
                AT_AUTHR  0   0   0   0   0   0     N     N 
   AT_SSD_UPDATE_SUCCESS  0   0   0   1   0   0     N     N 
       AT_NEXT_PSEUDONYM  0   0   0   0   0   0     N     N 
       AT_NEXT_REAUTH_ID  0   0   0   0   0   0     N     N 
         AT_NOTIFICATION  0   0   0   0   0   0     N     N 
    AT_CLIENT_ERROR_CODE  0   0   0   0   0   0     N     N 

   It should be noted that attributes AT_PERMANENT_ID_REQ, 
   AT_ANY_ID_REQ and AT_FULLAUTH_ID_REQ are mutually exclusive, so that 
   only one of them can be included at the same time. In 
   re-authentication and full authentication, the attributes AT_RAND 
   and AT_RANDU are mutually exclusive, only one of them can be 
   included at the same time. If one of the attributes AT_IV and 
   AT_ENCR_DATA is included, then both of the attributes MUST be 
   included.

7.2. AT_MAC 

   The AT_MAC attribute is used for EAP/CAVE message authentication. 
   Section 6 specifies which messages AT_MAC MUST be included.  

   The value field of the AT_MAC attribute contains two reserved bytes 
   followed by a keyed message authentication code (MAC). The MAC is 
   calculated over the whole EAP packet concatenated with optional 
   message-specific data, with the exception that the value field of 
   the MAC attribute is set to zero when calculating the MAC. The EAP 
   packet includes the EAP header that begins with the Code field, the 
   EAP/CAVE header that begins with the Subtype field, and all the 
   attributes, as specified in Section 5.1. The reserved bytes in 
   AT_MAC are set to zero when sending and ignored on reception. The 
   contents of the message-specific data that may be included in the 
   MAC calculation are specified separately for each EAP/CAVE message in 
   Section 6.  




Lizhiming                                         [Page 46]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   The format of the AT_MAC attribute is shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |     AT_MAC    | Length = 5    |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                                                               | 
   |                           MAC                                 | 
   |                                                               | 
   |                                                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   The MAC algorithm is HMAC-SHA1-128 [RFC 2104] keyed hash value. (The 
   HMAC-SHA1-128 value is obtained from the 20-byte HMAC-SHA1 value by 
   truncating the output to 16 bytes. Hence, the length of the MAC is 
   16 bytes.) The derivation of the authentication key (K_aut) used in 
   the calculation of the MAC is specified in Section 4.7.  

   When the AT_MAC attribute is included in an EAP/CAVE message, the 
   recipient MUST process the AT_MAC attribute before looking at any 
   other attributes. If the message authentication code is invalid, 
   then the recipient MUST ignore all other attributes in the message 
   and operate as specified in Section 4.6. 

7.3. AT_IV, AT_ENCR_DATA and AT_PADDING 

   AT_IV and AT_ENCR_DATA attributes can be used to transmit encrypted 
   information between the EAP/CAVE peer and server.  

   The value field of AT_IV contains two reserved bytes followed by a 
   16-byte initialization vector required by the AT_ENCR_DATA 
   attribute. The reserved bytes are set to zero when sending and 
   ignored on reception. The AT_IV attribute MUST be included if and 
   only if the AT_ENCR_DATA is included. Section 4.6 specifies the 
   operation if a packet that does not meet this condition is 
   encountered. 

   The sender of the AT_IV attribute chooses the initialization vector 
   by random. The sender MUST NOT reuse the initialization vector value 
   from previous EAP CAVE packets and the sender MUST choose it freshly 
   for each AT_IV attribute. The sender SHOULD use a good source of 
   randomness to generate the initialization vector. Please see [RFC 
   1750] for more information about generating random numbers for 
   security applications. The format of AT_IV is shown below. 








Lizhiming                                         [Page 47]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |     AT_IV     | Length = 5    |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                                                               | 
   |                 Initialization Vector                         | 
   |                                                               | 
   |                                                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The value field of the AT_ENCR_DATA attribute consists of two 
   reserved bytes followed by cipher text bytes encrypted using the 
   Advanced Encryption Standard (AES) [AES] in the Cipher Block 
   Chaining (CBC) mode of operation using the initialization vector 
   from the AT_IV attribute. The reserved bytes are set to zero when 
   sending and ignored on reception. Please see [CBC] for a description 
   of the CBC mode. The format of the AT_ENCR_DATA attribute is shown 
   below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | AT_ENCR_DATA  | Length        |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                                                               | 
   .                    Encrypted Data                             . 
   .                                                               . 
   |                                                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   The derivation of the encryption key (K_encr) is specified in 
   Section 4.7. 

   The plaintext consists of nested EAP/CAVE attributes. 

   The encryption algorithm requires the length of the plaintext to be 
   a multiple of 16 bytes. The sender may need to include the 
   AT_PADDING attribute as the last attribute within AT_ENCR_DATA. The 
   AT_PADDING attribute is not included if the total length of other 
   nested attributes within the AT_ENCR_DATA attribute is a multiple of 
   16 bytes. As usual, the Length of the Padding attribute includes the 
   Attribute Type and Attribute Length fields. The length of the 
   Padding attribute is 4, 8 or 12 bytes. It is chosen so that the 
   length of the value field of the AT_ENCR_DATA attribute becomes a 
   multiple of 16 bytes. The actual pad bytes in the value field are 
   set to zero (0x00) on sending. The recipient of the message MUST 
   verify that the pad bytes are set to zero. If this verification 
   fails on the peer, then it MUST send the EAP-Response/UIM/Client-
   Error packet with the error code "unable to process packet" to 


Lizhiming                                         [Page 48]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   terminate the authentication exchange. If this verification fails on 
   the server, then the server sends EAP Failure to terminate the 
   authentication exchange. The format of the AT_PADDING attribute is 
   shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  AT_PADDING   | Length        | Padding...                    | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               | 
   |                                                               | 
   |                                                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
    
7.4. AT_VERSION_LIST 

   The format of the AT_VERSION_LIST attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      | AT_VERSION_L..| Length        | Actual Version List Length    | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |  Supported Version 1          |  Supported Version 2          | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      .                                                               . 
      .                                                               . 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      | Supported Version N           |     Padding                   | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   This attribute is used in version negotiation, as specified in 
   Section 4.1. The attribute contains the version numbers supported by 
   the EAP/CAVE server. The server MUST only include versions that it 
   implements and that are allowed in its security policy. The server 
   SHOULD list the versions in the order of preference, most preferred 
   versions first. At least one version number MUST be included. The 
   version number for the protocol described in this document is one 
   (0x0001). 

   The value field of this attribute begins with 2-byte Actual Version 
   List Length, which specifies the length of the Version List in 
   bytes, not including the Actual Version List Length attribute 
   length. This field is followed by the list of the versions supported 
   by the server, which each have a length of 2 bytes. For example, if 
   there is only one supported version, then the Actual Version List 
   Length is 2. Because the length of the attribute must be a multiple 
   of 4 bytes, the sender pads the value field with zero bytes when 
   necessary. 



Lizhiming                                         [Page 49]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.5. AT_SELECTED_VERSION 

   The format of the AT_SELECTED_VERSION attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      | AT_SELECTED...| Length = 1    |    Selected Version           | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   This attribute is used in version negotiation, as specified in 
   Section 4.1. The value field of this attribute contains a two-byte 
   version number, which indicates the EAP/CAVE version that the peer 
   wants to use. 

7.6. AT_NONCE_MT 

   The format of the AT_NONCE_MT attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |AT_NONCE_MT    | Length = 5    |           Reserved            | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                                                               | 
      |                           NONCE_MT                            | 
      |                                                               | 
      |                                                               | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   The value field of the NONCE_MT attribute contains two reserved 
   bytes followed by a random number generated by the peer (16 bytes 
   long) freshly for this EAP/CAVE authentication exchange. The random 
   number is used as a seed value for the new keying material. The 
   reserved bytes are set to zero upon sending and ignored upon 
   reception. 

   The peer MUST choose the NONCE_MT value freshly for each EAP/CAVE 
   authentication exchange. If an EAP/CAVE exchange includes several 
   EAP/UIM/Start rounds, then the peer MAY use the same NONCE_MT value 
   in all EAP-Response/UIM/Start packets. The peer SHOULD use a good 
   source of randomness to generate NONCE_MT. Please see [RFC 1750] for 
   more information about generating random numbers for security 
   applications. 








Lizhiming                                         [Page 50]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.7. AT_PERMANENT_ID_REQ 

   The format of the AT_PERMANENT_ID_REQ attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |AT_PERM..._REQ | Length = 1    |           Reserved            | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
       

   The use of the AT_PERMANENT_ID_REQ is defined in Section 4.2. The 
   value field only contains two reserved bytes, which are set to zero 
   on sending and ignored on reception. 

7.8. AT_ANY_ID_REQ 

   The format of the AT_ANY_ID_REQ attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |AT_ANY_ID_REQ  | Length = 1    |           Reserved            | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   The use of the AT_ANY_ID_REQ is defined in Section 4.2. The value 
   field only contains two reserved bytes, which are set to zero on 
   sending and ignored on reception. 

7.9. AT_FULLAUTH_ID_REQ 

   The format of the AT_FULLAUTH_ID_REQ attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |AT_ANY_ID_REQ  | Length = 1    |           Reserved            | 
      +---------------+---------------+-------------------------------+ 
    
   The use of the AT_FULLAUTH_ID_REQ is defined in Section 4.2. The 
   value field only contains two reserved bytes, which are set to zero 
   on sending and ignored on reception. 











Lizhiming                                         [Page 51]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.10. AT_IDENTITY 

   The format of the AT_IDENTITY attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      | AT_IDENTITY   | Length        | Actual Identity Length        | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                                                               | 
      .                       Identity (optional)                     . 
      .                                                               . 
      |                                                               | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The use of the AT_IDENTITY is defined in Section 4.2. The value 
   field of this attribute begins with 2-byte actual identity length, 
   which specifies the length of the identity in bytes. This field is 
   followed by the subscriber identity of the indicated actual length. 
   The identity is the permanent identity, a pseudonym identity or a 
   re-authentication identity. The identity format is specified in 
   Section 4.2.1. The same identity format is used in the AT_IDENTITY 
   attribute and the EAP-Response/Identity packet, with the exception 
   that the peer MUST NOT decorate the identity it includes in 
   AT_IDENTITY. The identity does not include any terminating null 
   characters. Because the length of the attribute must be a multiple 
   of 4 bytes, the sender pads the identity with zero bytes when 
   necessary. 

7.11. AT_RAND 

   The format of the AT_RAND attribute is shown below. 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     | AT_RAND       | Length =2     |           Reserved            | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |                            RAND                               | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The value field of this attribute contains two reserved bytes 
   followed by the RAND (4 bytes). The reserved bytes are 
   set to zero upon sending and ignored upon reception.  










Lizhiming                                         [Page 52]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.12. AT_NEXT_REAUTH_ID 

   The format of the AT_NEXT_REAUTH_ID attribute is shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | AT_NEXT_REAU..| Length        | Actual Re-Auth Identity Length| 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                                                               | 
   .                   Next Re-authentication Username             . 
   .                                                               . 
   |                                                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The value field of this attribute begins with 2-byte actual re-
   authentication identity length which specifies the length of the 
   following re-authentication identity in bytes. This field is 
   followed by a re-authentication identity that the peer can use in 
   the next re-authentication, as described in Section 4.3. In 
   environments where a realm portion is required, the re-
   authentication identity includes both a username portion and a realm 
   name portion. The re-authentication identity does not include any 
   terminating null characters. Because the length of the attribute 
   must be a multiple of 4 bytes, the sender pads the re-authentication 
   identity with zero bytes when necessary. The identity encoding MUST 
   follow the UTF-8 transformation format [RFC2279]. 

7.13. AT_RANDU 

   The format of the AT_RANDU attribute is shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  AT_RANDU     | Length=2      |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | Reserved      |         RANDU                                 | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   The value field of this attribute contains three reserved bytes 
   followed by the RANDU (3 bytes). The reserved bytes are 
   set to zero upon sending and ignored upon reception.  
    










Lizhiming                                         [Page 53]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.14. AT_RANDBS 

   The format of the AT_RANDBS attribute is shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  AT_RANDBS    | Length=2      |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                         RANDBS                                | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   The value field of this attribute contains three reserved bytes 
   followed by the RANDBS (4 bytes). The reserved bytes are 
   set to zero upon sending and ignored upon reception.  
    
7.15. AT_RANDSSD 

   The format of the AT_RANDSSD attribute is shown below. 

    
    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | AT_RANDSSD    | Length = 3    |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | Reserved      |                                               | 
   +-+-+-+-+-+-+-+-+                                               | 
   |                            RANDSSD                            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The value field of the AT_RANDSSD attribute contains three reserved 
   bytes followed by a random number generated by the AC (7 bytes) 
   freshly for this EAP/CAVE SSD Update. The random number is 
   used as a seed for the new SSD. The reserved bytes are set to zero 
   upon sending and ignored upon reception. 

7.16. AT_NOTIFICATION 

   The format of the AT_NOTIFICATION attribute is shown below. 

     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |AT_NOTIFICATION| Length = 1    |F|P|  Notification Code        | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The value field of this attribute contains a two-byte notification 
   code. The first and second bit (F and P) of the notification code 
   are interpreted as described in Section 4.5. 

   The notification code values listed below have been reserved. The 
   descriptions below illustrate the semantics of the notifications. 

Lizhiming                                         [Page 54]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   The peer implementation MAY use different wordings when presenting 
   the notifications to the user. The "requested service" depends on 
   the environment where EAP/CAVE is applied. 

   1026 - User has been temporarily denied access to the requested 
   service. (Implies failure, used after the challenge round) 

   1031 - User has not subscribed to the requested service (implies 
   failure, used after the challenge round) 

7.17. AT_CLIENT_ERROR_CODE 

   The format of the AT_CLIENT_ERROR_CODE attribute is shown below. 

     0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |AT_CLIENT_ERR..| Length = 1    |     Client Error Code         | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
   The value field of this attribute contains a two-byte client error 
   code. The following error code values have been reserved.  
    
   0    "unable to process packet": a general error code  
    
   1    "unsupported version": the peer does not support any of 
        the versions listed in AT_VERSION_LIST 
    
   2    "insufficient number of challenges": the peer's policy 
        requires more triplets than the server included in AT_RAND 
    
   3    "RAND are not fresh": the peer believes that the RAND 
        challenges included in AT_RAND were not fresh 

7.18. AT_SSD_UPDATE_SUCCESS 

   The format of the AT_SSD_UPDATE_SUCCESS attribute is shown below. 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |AT_SSD_UP_SUC  | Length = 1    |           Reserved            | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   The use of the AT_SSD_UPDATE_SUCCESS is defined in Section 4.4. The 
   value field only contains two reserved bytes, which are set to zero 
   on sending and ignored on reception. 






Lizhiming                                         [Page 55]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

7.19. AT_ESN 

   The format of the AT_ESN attribute is shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  AT_ESN       | Length=2      |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | 				ESN                                | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   The value field of this attribute contains two reserved bytes 
   followed by the ESN (4 bytes). The reserved bytes are 
   set to zero upon sending and ignored upon reception.  
    
7.20. AT_AUTHR 

   The format of the AT_AUTHR attribute is shown below. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  AT_AUTHR     | Length=2      |           Reserved            | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | Reserved      |         AUTHR                                 | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   The value field of this attribute contains three reserved bytes 
   followed by the AUTHR (3 bytes). The reserved bytes are 
   set to zero upon sending and ignored upon reception.  
    

8. IANA Considerations 

   The realm name "owlan.org" has been reserved for NAI realm names 
   generated from the IMSI. 



   EAP/CAVE messages include a Subtype field. The following Subtypes are 
   temporarily specified: 












Lizhiming                                         [Page 56]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


        Start..........................................10 
        Challenge......................................11 
        Notification...................................12 
        Re-authentication..............................13 
        Client-Error...................................14 
        Update.........................................15
        Update_server_challenge........................16
        Update_Client_success..........................17
        Update_Challenge...............................18
        
   The Subtype-specific data is composed of attributes, which have 
   attribute type numbers. The following attribute types are 
   temporarily specified: 

        AT_RAND.........................................1 
        AT_PADDING......................................6 
        AT_NONCE_MT.....................................7 
        AT_PERMANENT_ID_REQ............................10 
        AT_MAC.........................................11 
        AT_NOTIFICATION................................12 
        AT_ANY_ID_REQ..................................13 
        AT_IDENTITY....................................14 
        AT_VERSION_LIST................................15 
        AT_SELECTED_VERSION............................16 
        AT_FULLAUTH_ID_REQ.............................17 
        AT_RANDU.......................................19 
        AT_RANDSSD.....................................20 
        AT_RANDBS......................................22 
        AT_ESN.........................................24 
        AT_AUTHR.......................................26 
        AT_CLIENT_ERROR_CODE...........................28 
    
        AT_IV.........................................129 
        AT_ENCR_DATA..................................130 
        AT_NEXT_REAUTH_ID.............................133 
    
    
   The AT_NOTIFICATION attribute contains a notification code value. 
   Values 1024, 1026 and 1031 have been specified in Section 7.16 of 
   this document. 

   The AT_VERSION_LIST and AT_SELECTED_VERSION attributes contain 
   version numbers. Version 1 has been specified in Section 7.4 of this 
   document. 

   The AT_CLIENT_ERROR_CODE attribute contains a client error code. 
   Values 0, 1, 2 and 3 have been specified in Section 7.17 of this 
   document. 





Lizhiming                                         [Page 57]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

   All requests for value assignment from the various number spaces 
   described in this document require proper documentation, according 
   to the "Specification Required" policy described in [RFC 2434]. 
   Requests must be specified in sufficient detail so that 
   interoperability between independent implementations is possible. 
   Possible forms of documentation include, but are not limited to, 
   RFCs, the products of another standards body (e.g. 3GPP2), or 
   permanently and readily available vendor design notes. 


9. Security Considerations 

   The EAP base protocol [EAP] highlights several attacks that are 
   possible against the EAP protocol as there is no inherent security 
   mechanisms provided. This section discusses the claimed security 
   properties of EAP CAVE as well as vulnerabilities and security 
   recommendations. 

9.1. Identity Protection 

   EAP/CAVE includes optional identity privacy support that protects the 
   privacy of the subscriber identity against passive eavesdropping. 
   The mechanism cannot be used on the first EAP exchange with a given 
   server, because the permanent identity will have to be sent in the 
   clear. The terminal SHOULD store the pseudonym in a non-volatile 
   memory so that it can be maintained across reboots. An active 
   attacker that impersonates the network may use the 
   AT_PERMANENT_ID_REQ attribute to attempt to learn the subscriber's 
   permanent identity. However, as discussed in Section 4.2.2, the 
   terminal can refuse to send the cleartext permanent identity if it 
   believes that the network should be able to recognize the pseudonym.  

   If the peer and server cannot guarantee that the pseudonym will be 
   maintained reliably and identity privacy is required then additional 
   protection from an external security mechanism such as Protected 
   Extensible Authentication Protocol (PEAP) [PEAP] may be used. If an 
   external security mechanism is in use the identity privacy features 
   of EAP-CAVE may not be useful. The security considerations of using 
   an external security mechanism with EAP-CAVE are beyond the scope of 
   this document. 

9.2. Mutual Authentication 

   EAP/CAVE provides mutual authentication. The peer believes that the 
   network is authentic because the network can calculate a correct 
   AT_MAC value in the EAP-Request/UIM/Challenge packet. 

   Since the security of EAP/CAVE is based on the secrecy of CMEA key. 
   care should be taken not to expose these values to attackers when 
   they are transmitted between entities, stored or handled. Steps 
   should be taken to limit the transport, storage and handling of 
   this values outside a protected environment. These considerations 
   are important at both the peer and EAP server implementations. 

Lizhiming                                         [Page 58]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


9.3. Key Derivation 

   EAP/CAVE supports key derivation. The key hierarchy is specified in
   Section 4.7. The actual strength of the resulting keys depends, 
   among other things, on some operator specific parameters including 
   authentication algorithms, the strength of the A-key, and the 
   quality of the RAND or RANDU challenges. Because the strength of 
   the CMEA key is 64 bits, the ultimate strength of any derived secret
   key material is never more than 64 bits. 

   The EAP Transient Keys used to protect EAP CAVE 
   packets (K_encr, K_aut) and the Master Session Key are 
   cryptographically separate. An attacker cannot derive any non-
   trivial information from K_encr or K_aut based on the Master Session 
   Key or vice versa. An attacker also cannot calculate the pre-shared 
   secret from the cdma CMEA key used, EAP CAVE K_encr, EAP CAVE K_aut, or 
   from the Master Session Key. 

   Each EAP/CAVE exchange generates fresh keying material. The EAP CAVE 
   peer contributes to the keying material with the NONCE_MT parameter, 
   which must be chosen freshly for each exchange. 

9.4. Dictionary Attacks 

   Because EAP/CAVE is not a password protocol, it is not vulnerable to 
   dictionary attacks. (The pre-shared symmetric secret stored on the 
   UIM card shall not be a weak password.) 

9.5. Credentials Reuse 
























Lizhiming                                         [Page 59]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


9.6. Integrity and Replay Protection, and Confidentiality 

   AT_MAC, AT_IV and AT_ENCR_DATA attributes are used to provide 
   integrity, replay and confidentiality protection for EAP/CAVE 
   requests and responses. Integrity protection includes the EAP 
   header. These attributes cannot be used during the EAP/UIM/Start 
   roundtrip. However, the protocol values (identity, NONCE_MT and 
   version negotiation parameters) are protected by later EAP/CAVE 
   messages.  

   Integrity protection (AT_MAC) is based on a keyed message 
   authentication code. Confidentiality (AT_ENCR_DATA and AT_IV) is 
   based on a block cipher.  

   On full authentication, replay protection is provided by the RAND 
   or RANDU values from the underlying cdma authentication scheme and 
   the use of the NONCE_MT value. On re-authentication, a similar way 
   is used to provide replay protection. 

   Contents of the EAP-Response/Identity packet are implicitly 
   integrity protected by including them in key derivation. 

   Because EAP/CAVE is not a tunneling method, EAP Notification, EAP 
   Success or EAP Failure packets are not confidential, integrity 
   protected or replay protected in EAP/CAVE. On physically insecure 
   networks, this may enable an attacker to send false notifications to 
   the peer and to mount denial of service attacks by spoofing these 
   packets. 

   An eavesdropper will see the EAP Notification, EAP Success and EAP 
   Failure packets sent in the clear. With EAP CAVE, confidential 
   information MUST NOT be transmitted in EAP Notification packets. 
    

9.7. Negotiation Attacks 

   EAP/CAVE does not protect the EAP-Response/Nak packet. Because 
   EAP/CAVE does not protect the EAP method negotiation, EAP method 
   downgrading attacks may be possible, especially if the user uses the 
   same identity with EAP/CAVE and other EAP methods. 

   EAP/CAVE includes a version negotiation procedure. In EAP/CAVE the 
   keying material derivation includes the version list and selected 
   version to ensure that the protocol cannot be downgraded and that 
   the peer and server use the same version of EAP/CAVE. 

   As described in Section 5, EAP/CAVE allows the protocol to be 
   extended by defining new attribute types. When defining such 
   attributes, it should noted that any extra attributes included in 
   EAP-Request/UIM/Start or EAP-Response/UIM/Start packets are not 
   included in the MACs later on, and thus some other precautions must 
   be taken to avoid modifications to them. 

Lizhiming                                         [Page 60]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


   EAP/CAVE does not support ciphersuite negotiation. 

9.8. Fast Reconnect 

   EAP/CAVE includes an optional re-authentication ("fast reconnect") 
   procedure, as recommended in [EAP] for EAP types that are intended 
   for physically insecure networks. 

9.9. Acknowledged Result Indications 

   EAP/CAVE does not provide acknowledged or integrity protected Success 
   or Failure indications. 

   If an EAP Success or EAP Failure packet is lost when using EAP/CAVE 
   over an unreliable medium and if the protocol over which EAP/CAVE is 
   transported does not address the possible loss of Success or 
   Failure, then the peer and EAP server may end up having a different 
   interpretation of the state of the authentication conversation. 

   On physically insecure networks, an attacker may mount denial of 
   service attacks by sending false EAP Success or EAP Failure 
   indications. However, the attacker cannot force the peer or the EAP 
   server to believe successful authentication has occurred when mutual 
   authentication failed or has not happened yet. 

9.10. Man-in-the-middle Attacks 

   In order to avoid man-in-the-middle attacks and session hijacking, 
   user data SHOULD be integrity protected on physically insecure 
   networks. The EAP/CAVE Master Session Key or keys derived from it MAY 
   be used as the integrity protection keys, or, if an external 
   security mechanism such as PEAP is used, then the link integrity 
   protection keys MAY be derived by the external security mechanism.  

   There are man-in-the-middle attacks associated with the use of any 
   EAP method within a tunneled protocol such as PEAP, or within a 
   sequence of EAP methods followed by each other. This specification 
   does not address these attacks. If EAP/CAVE is used with a tunneling 
   protocol or as part of a sequence of methods, there should be 
   cryptographic binding provided between the protocols and EAP/CAVE to 
   prevent man-in-the-middle attacks through rogue authenticators being 
   able to setup one-way authenticated tunnels. The EAP/CAVE Master 
   Session Key MAY be used to provide the cryptographic binding. 
   However the mechanism how the binding is provided depends on the 
   tunneling or sequencing protocol and is beyond the scope of this 
   document. 







Lizhiming                                         [Page 61]

Internet Draft          EAP CAVE Authentication        15 April, 2004    

9.11. Generating Random Numbers 

   An EAP/CAVE implementation SHOULD use a good source of randomness to 
   generate the random numbers required in the protocol. Please see 
   [RFC 1750] for more information on generating random numbers for 
   security applications. 

10. Security Claims 

   This section provides the security claims required by [EAP]. 

   [a] Intended use. EAP CAVE is intended for use over both physically 
   insecure networks and physically or otherwise secure networks. 
   Applicable media include but are not limited to PPP, IEEE 802 wired 
   networks and IEEE 802.11. 

   [b] Mechanism. EAP CAVE is based on the cama CAVE mechanism, which is a 
   challenge/response authentication and key agreement mechanism based 
   on a symmetric 64-bit pre-shared secret. EAP CAVE also makes use of 
   a peer challenge to provide mutual authentication. 

   [c] Security claims. The security properties of the method are 
   discussed in Section 9. 

   [d] Key strength. EAP CAVE supports key derivation with 64-bit 
   effective key strength. However, as discussed in Section 9, if the 
   same credentials are used in cdma and in EAP/CAVE, then the key 
   strength may be reduced considerably, basically to the same level as 
   in cdma, by mounting attacks over cdma. For example an active 
   attack using a false cdma base station reduces the effective key 
   strength to almost zero. 

   [e] Description of key hierarchy. Please see Section 4.7. 

   [f] Indication of vulnerabilities. Vulnerabilities are discussed in 
   Section 9. 














Lizhiming                                         [Page 62]

Internet Draft          EAP CAVE Authentication        15 April, 2004    


11. Acknowledgements and Contributions 

11.1. Contributors 
   
   In addition to the editors, Nora Dabbous, JunHyuk Song, and 
   Jian Wang were significant contributors to this  document. 



11.2. Acknowledgements 

   This protocol has been partly developed based on the EAP SIM 
   [EAP SIM], and hence this specification incorporates many ideas from
   Jari Arkko. 

Normative References 

   [3GPP2 S.S0053] 3GPP2 Technical Specification 3GPP2 S.S0053 V1.0: 
   "Common Cryptographic Algorithms", 
   3rd Generation Partnership Project 2, Jan 2002. 

   [3GPP2 N.S0005] 3GPP2 Technical Specification 3GPP2 N.S0005 V1.0: 
   "Cellular Radiotelecommunications Intersystem Operations", 
   3rd Generation Partnership Project 2, June 2001. 

   [RFC 2119] S. Bradner, "Key words for use in RFCs to indicate 
   Requirement Levels", RFC 2119, March 1997. 

   [3GPP2 N.S0009] 3GPP2 Technical Specification 3GPP2 N.S0009 V1.0: 
   "IMSI", 3rd Generation Partnership Project 2, June 2001.

   [RFC 2486] Aboba, B. and M. Beadles, "The Network Access 
   Identifier", RFC 2486, January 1999. 

   [RFC 2104] H. Krawczyk, M. Bellare, R. Canetti, "HMAC: Keyed-Hashing 
   for Message Authentication", RFC 2104, February 1997. 

   [AES] Federal Information Processing Standards (FIPS) Publication 
   197, "Advanced Encryption Standard (AES)", National Institute of 
   Standards and Technology, November 26, 2001. 
   http://csrc.nist.gov/publications/fips/fips197/fips-197.pdf 

   [CBC] NIST Special Publication 800-38A, "Recommendation for Block 
   Cipher Modes of Operation - Methods and Techniques", National 
   Institute of Standards and Technology, December 2001. 
   http://csrc.nist.gov/publications/nistpubs/800-38a/sp800-38a.pdf 

   [SHA-1] Federal Information Processing Standard (FIPS) Publication 
   180-1, "Secure Hash Standard," National Institute of Standards and 
   Technology, U.S. Department of Commerce, October 17, 1995. 



Lizhiming                                         [Page 63]

Internet Draft          EAP CAVE Authentication        15 April, 2004

   [PRF] Federal Information Processing Standards (FIPS) Publication 
   186-2 (with change notice), "Digital Signature Standard (DSS)", 
   National Institute of Standards and Technology, January 27, 2000. 
   Available on-line at: 
   http://csrc.nist.gov/publications/fips/fips186-2/fips186-2-
   change1.pdf 

   [RFC 2434] T. Narten, H. Alvestrand, "Guidelines for Writing an IANA 
   Considerations Section in RFCs", RFC 2434, October 1998. 

   [RFC2279]  F. Yergeau, "UTF-8, a transformation format of ISO 
   10646", RFC 2279, January 1998. 

   [EAP] L. Blunk et al., "Extensible Authentication Protocol 
   (EAP)", draft-ietf-eap-rfc2284bis-05.txt, work-in-progress, 
   September 2003.

Informative References 

   [PEAP] H. Andersson, S. Josefsson, G. Zorn, D. Simon, A. Palekar, 
   "Protected EAP Protocol (PEAP)", draft-josefsson-pppext-eap-tls-eap-
   05.txt, work-in-progress, September 2002. 

   [RFC 1750] D. Eastlake, 3rd, S. Crocker, J. Schiller, "Randomness 
   Recommendations for Security",  RFC 1750 (Informational), December 
   1994.  

   [RFC 3344] C. Perkins (editor), "IP Mobility Support", RFC 3344, 
   August 2002. 

   [EAP SIM] H. Haverinen, J. Salowey, "EAP SIM Authentication", draft-
   arkko-pppext-eap-sim-12.txt, Oct 2003 (work in progress). 

   [RFC 2548] G. Zorn, "Microsoft Vendor-specific RADIUS Attributes", 
   RFC 2548, March 1999 









Lizhiming                                         [Page 64]

Internet Draft          EAP CAVE Authentication        15 April, 2004

Editors' and Contributors' Contact Information 

   Zhiming Li 
   Huawei Technologies Co., LTD 
   Pudong Lujiazui Software Park
   No 98, Lane 91, Eshan Road, Pudong, Shanghai,China, 200127
   E-mail: lizhiming@huawei.com 
   Phone: +86 21 68644808-24039
    
   Nora Dabbous  
   Gemplus  
   34 rue Guynemer 
   92447 Issy les Moulineaux   France  
   E-mail: nora.dabbous@gemplus.com  
   Phone: +33 1 4648 2000 

   JunHyuk Song
   Samsung Electronics
   NTP Lab1
   Email: junhyuk.song@samsung.com
   Phone: +82 31 279-3639

   Jian Wang
   Datang Mirco elctronics Technology
   No 40, Xueyuan Road, Haidian District, Beijing, China,100083
   E-mail:wangj@dmt.com.cn
   Phoneú¦+86-10-62302680


Annex A. Pseudo-Random Number Generator 

   The "|" character denotes concatenation, and "^" denotes involution. 
    
   Step 1: Choose a new, secret value for the seed-key, XKEY 
    
   Step 2: In hexadecimal notation let 
       t = 67452301 EFCDAB89 98BADCFE 10325476 C3D2E1F0 
       This is the initial value for H0|H1|H2|H3|H4  
       in the FIPS SHS [SHA-1] 
    
   Step 3: For j = 0 to m - 1 do 
         3.1 XSEED_j = 0 /* no optional user input */ 
         3.2 For i = 0 to 1 do 
             a. XVAL = (XKEY + XSEED_j) mod 2^b 
             b. w_i = G(t, XVAL) 
             c. XKEY = (1 + XKEY + w_i) mod 2^b 
         3.3 x_j = w_0|w_1 


Lizhiming                                         [Page 65]

Internet Draft          EAP CAVE Authentication        15 April, 2004